###################################################################

# Created by write_sdc on Thu Dec 14 05:36:34 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max ss_typical_max_0p81v_125c -max_library           \
sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c\
                         -min ff_typical_min_0p99v_m40c -min_library           \
sc9_cln40g_base_rvt_ff_typical_min_0p99v_m40c
set_wire_load_mode top
set_wire_load_model -name Zero -library                                        \
sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 5.5  -waveform {0 2.75}
set_input_delay -clock clk  0  [get_ports reset]
set_input_delay -clock clk  0  [get_ports start]
set_input_delay -clock clk  0  [get_ports {data_in[8]}]
set_input_delay -clock clk  0  [get_ports {data_in[7]}]
set_input_delay -clock clk  0  [get_ports {data_in[6]}]
set_input_delay -clock clk  0  [get_ports {data_in[5]}]
set_input_delay -clock clk  0  [get_ports {data_in[4]}]
set_input_delay -clock clk  0  [get_ports {data_in[3]}]
set_input_delay -clock clk  0  [get_ports {data_in[2]}]
set_input_delay -clock clk  0  [get_ports {data_in[1]}]
set_input_delay -clock clk  0  [get_ports {data_in[0]}]
set_input_delay -clock clk  0  [get_ports {kernel[1151]}]
set_input_delay -clock clk  0  [get_ports {kernel[1150]}]
set_input_delay -clock clk  0  [get_ports {kernel[1149]}]
set_input_delay -clock clk  0  [get_ports {kernel[1148]}]
set_input_delay -clock clk  0  [get_ports {kernel[1147]}]
set_input_delay -clock clk  0  [get_ports {kernel[1146]}]
set_input_delay -clock clk  0  [get_ports {kernel[1145]}]
set_input_delay -clock clk  0  [get_ports {kernel[1144]}]
set_input_delay -clock clk  0  [get_ports {kernel[1143]}]
set_input_delay -clock clk  0  [get_ports {kernel[1142]}]
set_input_delay -clock clk  0  [get_ports {kernel[1141]}]
set_input_delay -clock clk  0  [get_ports {kernel[1140]}]
set_input_delay -clock clk  0  [get_ports {kernel[1139]}]
set_input_delay -clock clk  0  [get_ports {kernel[1138]}]
set_input_delay -clock clk  0  [get_ports {kernel[1137]}]
set_input_delay -clock clk  0  [get_ports {kernel[1136]}]
set_input_delay -clock clk  0  [get_ports {kernel[1135]}]
set_input_delay -clock clk  0  [get_ports {kernel[1134]}]
set_input_delay -clock clk  0  [get_ports {kernel[1133]}]
set_input_delay -clock clk  0  [get_ports {kernel[1132]}]
set_input_delay -clock clk  0  [get_ports {kernel[1131]}]
set_input_delay -clock clk  0  [get_ports {kernel[1130]}]
set_input_delay -clock clk  0  [get_ports {kernel[1129]}]
set_input_delay -clock clk  0  [get_ports {kernel[1128]}]
set_input_delay -clock clk  0  [get_ports {kernel[1127]}]
set_input_delay -clock clk  0  [get_ports {kernel[1126]}]
set_input_delay -clock clk  0  [get_ports {kernel[1125]}]
set_input_delay -clock clk  0  [get_ports {kernel[1124]}]
set_input_delay -clock clk  0  [get_ports {kernel[1123]}]
set_input_delay -clock clk  0  [get_ports {kernel[1122]}]
set_input_delay -clock clk  0  [get_ports {kernel[1121]}]
set_input_delay -clock clk  0  [get_ports {kernel[1120]}]
set_input_delay -clock clk  0  [get_ports {kernel[1119]}]
set_input_delay -clock clk  0  [get_ports {kernel[1118]}]
set_input_delay -clock clk  0  [get_ports {kernel[1117]}]
set_input_delay -clock clk  0  [get_ports {kernel[1116]}]
set_input_delay -clock clk  0  [get_ports {kernel[1115]}]
set_input_delay -clock clk  0  [get_ports {kernel[1114]}]
set_input_delay -clock clk  0  [get_ports {kernel[1113]}]
set_input_delay -clock clk  0  [get_ports {kernel[1112]}]
set_input_delay -clock clk  0  [get_ports {kernel[1111]}]
set_input_delay -clock clk  0  [get_ports {kernel[1110]}]
set_input_delay -clock clk  0  [get_ports {kernel[1109]}]
set_input_delay -clock clk  0  [get_ports {kernel[1108]}]
set_input_delay -clock clk  0  [get_ports {kernel[1107]}]
set_input_delay -clock clk  0  [get_ports {kernel[1106]}]
set_input_delay -clock clk  0  [get_ports {kernel[1105]}]
set_input_delay -clock clk  0  [get_ports {kernel[1104]}]
set_input_delay -clock clk  0  [get_ports {kernel[1103]}]
set_input_delay -clock clk  0  [get_ports {kernel[1102]}]
set_input_delay -clock clk  0  [get_ports {kernel[1101]}]
set_input_delay -clock clk  0  [get_ports {kernel[1100]}]
set_input_delay -clock clk  0  [get_ports {kernel[1099]}]
set_input_delay -clock clk  0  [get_ports {kernel[1098]}]
set_input_delay -clock clk  0  [get_ports {kernel[1097]}]
set_input_delay -clock clk  0  [get_ports {kernel[1096]}]
set_input_delay -clock clk  0  [get_ports {kernel[1095]}]
set_input_delay -clock clk  0  [get_ports {kernel[1094]}]
set_input_delay -clock clk  0  [get_ports {kernel[1093]}]
set_input_delay -clock clk  0  [get_ports {kernel[1092]}]
set_input_delay -clock clk  0  [get_ports {kernel[1091]}]
set_input_delay -clock clk  0  [get_ports {kernel[1090]}]
set_input_delay -clock clk  0  [get_ports {kernel[1089]}]
set_input_delay -clock clk  0  [get_ports {kernel[1088]}]
set_input_delay -clock clk  0  [get_ports {kernel[1087]}]
set_input_delay -clock clk  0  [get_ports {kernel[1086]}]
set_input_delay -clock clk  0  [get_ports {kernel[1085]}]
set_input_delay -clock clk  0  [get_ports {kernel[1084]}]
set_input_delay -clock clk  0  [get_ports {kernel[1083]}]
set_input_delay -clock clk  0  [get_ports {kernel[1082]}]
set_input_delay -clock clk  0  [get_ports {kernel[1081]}]
set_input_delay -clock clk  0  [get_ports {kernel[1080]}]
set_input_delay -clock clk  0  [get_ports {kernel[1079]}]
set_input_delay -clock clk  0  [get_ports {kernel[1078]}]
set_input_delay -clock clk  0  [get_ports {kernel[1077]}]
set_input_delay -clock clk  0  [get_ports {kernel[1076]}]
set_input_delay -clock clk  0  [get_ports {kernel[1075]}]
set_input_delay -clock clk  0  [get_ports {kernel[1074]}]
set_input_delay -clock clk  0  [get_ports {kernel[1073]}]
set_input_delay -clock clk  0  [get_ports {kernel[1072]}]
set_input_delay -clock clk  0  [get_ports {kernel[1071]}]
set_input_delay -clock clk  0  [get_ports {kernel[1070]}]
set_input_delay -clock clk  0  [get_ports {kernel[1069]}]
set_input_delay -clock clk  0  [get_ports {kernel[1068]}]
set_input_delay -clock clk  0  [get_ports {kernel[1067]}]
set_input_delay -clock clk  0  [get_ports {kernel[1066]}]
set_input_delay -clock clk  0  [get_ports {kernel[1065]}]
set_input_delay -clock clk  0  [get_ports {kernel[1064]}]
set_input_delay -clock clk  0  [get_ports {kernel[1063]}]
set_input_delay -clock clk  0  [get_ports {kernel[1062]}]
set_input_delay -clock clk  0  [get_ports {kernel[1061]}]
set_input_delay -clock clk  0  [get_ports {kernel[1060]}]
set_input_delay -clock clk  0  [get_ports {kernel[1059]}]
set_input_delay -clock clk  0  [get_ports {kernel[1058]}]
set_input_delay -clock clk  0  [get_ports {kernel[1057]}]
set_input_delay -clock clk  0  [get_ports {kernel[1056]}]
set_input_delay -clock clk  0  [get_ports {kernel[1055]}]
set_input_delay -clock clk  0  [get_ports {kernel[1054]}]
set_input_delay -clock clk  0  [get_ports {kernel[1053]}]
set_input_delay -clock clk  0  [get_ports {kernel[1052]}]
set_input_delay -clock clk  0  [get_ports {kernel[1051]}]
set_input_delay -clock clk  0  [get_ports {kernel[1050]}]
set_input_delay -clock clk  0  [get_ports {kernel[1049]}]
set_input_delay -clock clk  0  [get_ports {kernel[1048]}]
set_input_delay -clock clk  0  [get_ports {kernel[1047]}]
set_input_delay -clock clk  0  [get_ports {kernel[1046]}]
set_input_delay -clock clk  0  [get_ports {kernel[1045]}]
set_input_delay -clock clk  0  [get_ports {kernel[1044]}]
set_input_delay -clock clk  0  [get_ports {kernel[1043]}]
set_input_delay -clock clk  0  [get_ports {kernel[1042]}]
set_input_delay -clock clk  0  [get_ports {kernel[1041]}]
set_input_delay -clock clk  0  [get_ports {kernel[1040]}]
set_input_delay -clock clk  0  [get_ports {kernel[1039]}]
set_input_delay -clock clk  0  [get_ports {kernel[1038]}]
set_input_delay -clock clk  0  [get_ports {kernel[1037]}]
set_input_delay -clock clk  0  [get_ports {kernel[1036]}]
set_input_delay -clock clk  0  [get_ports {kernel[1035]}]
set_input_delay -clock clk  0  [get_ports {kernel[1034]}]
set_input_delay -clock clk  0  [get_ports {kernel[1033]}]
set_input_delay -clock clk  0  [get_ports {kernel[1032]}]
set_input_delay -clock clk  0  [get_ports {kernel[1031]}]
set_input_delay -clock clk  0  [get_ports {kernel[1030]}]
set_input_delay -clock clk  0  [get_ports {kernel[1029]}]
set_input_delay -clock clk  0  [get_ports {kernel[1028]}]
set_input_delay -clock clk  0  [get_ports {kernel[1027]}]
set_input_delay -clock clk  0  [get_ports {kernel[1026]}]
set_input_delay -clock clk  0  [get_ports {kernel[1025]}]
set_input_delay -clock clk  0  [get_ports {kernel[1024]}]
set_input_delay -clock clk  0  [get_ports {kernel[1023]}]
set_input_delay -clock clk  0  [get_ports {kernel[1022]}]
set_input_delay -clock clk  0  [get_ports {kernel[1021]}]
set_input_delay -clock clk  0  [get_ports {kernel[1020]}]
set_input_delay -clock clk  0  [get_ports {kernel[1019]}]
set_input_delay -clock clk  0  [get_ports {kernel[1018]}]
set_input_delay -clock clk  0  [get_ports {kernel[1017]}]
set_input_delay -clock clk  0  [get_ports {kernel[1016]}]
set_input_delay -clock clk  0  [get_ports {kernel[1015]}]
set_input_delay -clock clk  0  [get_ports {kernel[1014]}]
set_input_delay -clock clk  0  [get_ports {kernel[1013]}]
set_input_delay -clock clk  0  [get_ports {kernel[1012]}]
set_input_delay -clock clk  0  [get_ports {kernel[1011]}]
set_input_delay -clock clk  0  [get_ports {kernel[1010]}]
set_input_delay -clock clk  0  [get_ports {kernel[1009]}]
set_input_delay -clock clk  0  [get_ports {kernel[1008]}]
set_input_delay -clock clk  0  [get_ports {kernel[1007]}]
set_input_delay -clock clk  0  [get_ports {kernel[1006]}]
set_input_delay -clock clk  0  [get_ports {kernel[1005]}]
set_input_delay -clock clk  0  [get_ports {kernel[1004]}]
set_input_delay -clock clk  0  [get_ports {kernel[1003]}]
set_input_delay -clock clk  0  [get_ports {kernel[1002]}]
set_input_delay -clock clk  0  [get_ports {kernel[1001]}]
set_input_delay -clock clk  0  [get_ports {kernel[1000]}]
set_input_delay -clock clk  0  [get_ports {kernel[999]}]
set_input_delay -clock clk  0  [get_ports {kernel[998]}]
set_input_delay -clock clk  0  [get_ports {kernel[997]}]
set_input_delay -clock clk  0  [get_ports {kernel[996]}]
set_input_delay -clock clk  0  [get_ports {kernel[995]}]
set_input_delay -clock clk  0  [get_ports {kernel[994]}]
set_input_delay -clock clk  0  [get_ports {kernel[993]}]
set_input_delay -clock clk  0  [get_ports {kernel[992]}]
set_input_delay -clock clk  0  [get_ports {kernel[991]}]
set_input_delay -clock clk  0  [get_ports {kernel[990]}]
set_input_delay -clock clk  0  [get_ports {kernel[989]}]
set_input_delay -clock clk  0  [get_ports {kernel[988]}]
set_input_delay -clock clk  0  [get_ports {kernel[987]}]
set_input_delay -clock clk  0  [get_ports {kernel[986]}]
set_input_delay -clock clk  0  [get_ports {kernel[985]}]
set_input_delay -clock clk  0  [get_ports {kernel[984]}]
set_input_delay -clock clk  0  [get_ports {kernel[983]}]
set_input_delay -clock clk  0  [get_ports {kernel[982]}]
set_input_delay -clock clk  0  [get_ports {kernel[981]}]
set_input_delay -clock clk  0  [get_ports {kernel[980]}]
set_input_delay -clock clk  0  [get_ports {kernel[979]}]
set_input_delay -clock clk  0  [get_ports {kernel[978]}]
set_input_delay -clock clk  0  [get_ports {kernel[977]}]
set_input_delay -clock clk  0  [get_ports {kernel[976]}]
set_input_delay -clock clk  0  [get_ports {kernel[975]}]
set_input_delay -clock clk  0  [get_ports {kernel[974]}]
set_input_delay -clock clk  0  [get_ports {kernel[973]}]
set_input_delay -clock clk  0  [get_ports {kernel[972]}]
set_input_delay -clock clk  0  [get_ports {kernel[971]}]
set_input_delay -clock clk  0  [get_ports {kernel[970]}]
set_input_delay -clock clk  0  [get_ports {kernel[969]}]
set_input_delay -clock clk  0  [get_ports {kernel[968]}]
set_input_delay -clock clk  0  [get_ports {kernel[967]}]
set_input_delay -clock clk  0  [get_ports {kernel[966]}]
set_input_delay -clock clk  0  [get_ports {kernel[965]}]
set_input_delay -clock clk  0  [get_ports {kernel[964]}]
set_input_delay -clock clk  0  [get_ports {kernel[963]}]
set_input_delay -clock clk  0  [get_ports {kernel[962]}]
set_input_delay -clock clk  0  [get_ports {kernel[961]}]
set_input_delay -clock clk  0  [get_ports {kernel[960]}]
set_input_delay -clock clk  0  [get_ports {kernel[959]}]
set_input_delay -clock clk  0  [get_ports {kernel[958]}]
set_input_delay -clock clk  0  [get_ports {kernel[957]}]
set_input_delay -clock clk  0  [get_ports {kernel[956]}]
set_input_delay -clock clk  0  [get_ports {kernel[955]}]
set_input_delay -clock clk  0  [get_ports {kernel[954]}]
set_input_delay -clock clk  0  [get_ports {kernel[953]}]
set_input_delay -clock clk  0  [get_ports {kernel[952]}]
set_input_delay -clock clk  0  [get_ports {kernel[951]}]
set_input_delay -clock clk  0  [get_ports {kernel[950]}]
set_input_delay -clock clk  0  [get_ports {kernel[949]}]
set_input_delay -clock clk  0  [get_ports {kernel[948]}]
set_input_delay -clock clk  0  [get_ports {kernel[947]}]
set_input_delay -clock clk  0  [get_ports {kernel[946]}]
set_input_delay -clock clk  0  [get_ports {kernel[945]}]
set_input_delay -clock clk  0  [get_ports {kernel[944]}]
set_input_delay -clock clk  0  [get_ports {kernel[943]}]
set_input_delay -clock clk  0  [get_ports {kernel[942]}]
set_input_delay -clock clk  0  [get_ports {kernel[941]}]
set_input_delay -clock clk  0  [get_ports {kernel[940]}]
set_input_delay -clock clk  0  [get_ports {kernel[939]}]
set_input_delay -clock clk  0  [get_ports {kernel[938]}]
set_input_delay -clock clk  0  [get_ports {kernel[937]}]
set_input_delay -clock clk  0  [get_ports {kernel[936]}]
set_input_delay -clock clk  0  [get_ports {kernel[935]}]
set_input_delay -clock clk  0  [get_ports {kernel[934]}]
set_input_delay -clock clk  0  [get_ports {kernel[933]}]
set_input_delay -clock clk  0  [get_ports {kernel[932]}]
set_input_delay -clock clk  0  [get_ports {kernel[931]}]
set_input_delay -clock clk  0  [get_ports {kernel[930]}]
set_input_delay -clock clk  0  [get_ports {kernel[929]}]
set_input_delay -clock clk  0  [get_ports {kernel[928]}]
set_input_delay -clock clk  0  [get_ports {kernel[927]}]
set_input_delay -clock clk  0  [get_ports {kernel[926]}]
set_input_delay -clock clk  0  [get_ports {kernel[925]}]
set_input_delay -clock clk  0  [get_ports {kernel[924]}]
set_input_delay -clock clk  0  [get_ports {kernel[923]}]
set_input_delay -clock clk  0  [get_ports {kernel[922]}]
set_input_delay -clock clk  0  [get_ports {kernel[921]}]
set_input_delay -clock clk  0  [get_ports {kernel[920]}]
set_input_delay -clock clk  0  [get_ports {kernel[919]}]
set_input_delay -clock clk  0  [get_ports {kernel[918]}]
set_input_delay -clock clk  0  [get_ports {kernel[917]}]
set_input_delay -clock clk  0  [get_ports {kernel[916]}]
set_input_delay -clock clk  0  [get_ports {kernel[915]}]
set_input_delay -clock clk  0  [get_ports {kernel[914]}]
set_input_delay -clock clk  0  [get_ports {kernel[913]}]
set_input_delay -clock clk  0  [get_ports {kernel[912]}]
set_input_delay -clock clk  0  [get_ports {kernel[911]}]
set_input_delay -clock clk  0  [get_ports {kernel[910]}]
set_input_delay -clock clk  0  [get_ports {kernel[909]}]
set_input_delay -clock clk  0  [get_ports {kernel[908]}]
set_input_delay -clock clk  0  [get_ports {kernel[907]}]
set_input_delay -clock clk  0  [get_ports {kernel[906]}]
set_input_delay -clock clk  0  [get_ports {kernel[905]}]
set_input_delay -clock clk  0  [get_ports {kernel[904]}]
set_input_delay -clock clk  0  [get_ports {kernel[903]}]
set_input_delay -clock clk  0  [get_ports {kernel[902]}]
set_input_delay -clock clk  0  [get_ports {kernel[901]}]
set_input_delay -clock clk  0  [get_ports {kernel[900]}]
set_input_delay -clock clk  0  [get_ports {kernel[899]}]
set_input_delay -clock clk  0  [get_ports {kernel[898]}]
set_input_delay -clock clk  0  [get_ports {kernel[897]}]
set_input_delay -clock clk  0  [get_ports {kernel[896]}]
set_input_delay -clock clk  0  [get_ports {kernel[895]}]
set_input_delay -clock clk  0  [get_ports {kernel[894]}]
set_input_delay -clock clk  0  [get_ports {kernel[893]}]
set_input_delay -clock clk  0  [get_ports {kernel[892]}]
set_input_delay -clock clk  0  [get_ports {kernel[891]}]
set_input_delay -clock clk  0  [get_ports {kernel[890]}]
set_input_delay -clock clk  0  [get_ports {kernel[889]}]
set_input_delay -clock clk  0  [get_ports {kernel[888]}]
set_input_delay -clock clk  0  [get_ports {kernel[887]}]
set_input_delay -clock clk  0  [get_ports {kernel[886]}]
set_input_delay -clock clk  0  [get_ports {kernel[885]}]
set_input_delay -clock clk  0  [get_ports {kernel[884]}]
set_input_delay -clock clk  0  [get_ports {kernel[883]}]
set_input_delay -clock clk  0  [get_ports {kernel[882]}]
set_input_delay -clock clk  0  [get_ports {kernel[881]}]
set_input_delay -clock clk  0  [get_ports {kernel[880]}]
set_input_delay -clock clk  0  [get_ports {kernel[879]}]
set_input_delay -clock clk  0  [get_ports {kernel[878]}]
set_input_delay -clock clk  0  [get_ports {kernel[877]}]
set_input_delay -clock clk  0  [get_ports {kernel[876]}]
set_input_delay -clock clk  0  [get_ports {kernel[875]}]
set_input_delay -clock clk  0  [get_ports {kernel[874]}]
set_input_delay -clock clk  0  [get_ports {kernel[873]}]
set_input_delay -clock clk  0  [get_ports {kernel[872]}]
set_input_delay -clock clk  0  [get_ports {kernel[871]}]
set_input_delay -clock clk  0  [get_ports {kernel[870]}]
set_input_delay -clock clk  0  [get_ports {kernel[869]}]
set_input_delay -clock clk  0  [get_ports {kernel[868]}]
set_input_delay -clock clk  0  [get_ports {kernel[867]}]
set_input_delay -clock clk  0  [get_ports {kernel[866]}]
set_input_delay -clock clk  0  [get_ports {kernel[865]}]
set_input_delay -clock clk  0  [get_ports {kernel[864]}]
set_input_delay -clock clk  0  [get_ports {kernel[863]}]
set_input_delay -clock clk  0  [get_ports {kernel[862]}]
set_input_delay -clock clk  0  [get_ports {kernel[861]}]
set_input_delay -clock clk  0  [get_ports {kernel[860]}]
set_input_delay -clock clk  0  [get_ports {kernel[859]}]
set_input_delay -clock clk  0  [get_ports {kernel[858]}]
set_input_delay -clock clk  0  [get_ports {kernel[857]}]
set_input_delay -clock clk  0  [get_ports {kernel[856]}]
set_input_delay -clock clk  0  [get_ports {kernel[855]}]
set_input_delay -clock clk  0  [get_ports {kernel[854]}]
set_input_delay -clock clk  0  [get_ports {kernel[853]}]
set_input_delay -clock clk  0  [get_ports {kernel[852]}]
set_input_delay -clock clk  0  [get_ports {kernel[851]}]
set_input_delay -clock clk  0  [get_ports {kernel[850]}]
set_input_delay -clock clk  0  [get_ports {kernel[849]}]
set_input_delay -clock clk  0  [get_ports {kernel[848]}]
set_input_delay -clock clk  0  [get_ports {kernel[847]}]
set_input_delay -clock clk  0  [get_ports {kernel[846]}]
set_input_delay -clock clk  0  [get_ports {kernel[845]}]
set_input_delay -clock clk  0  [get_ports {kernel[844]}]
set_input_delay -clock clk  0  [get_ports {kernel[843]}]
set_input_delay -clock clk  0  [get_ports {kernel[842]}]
set_input_delay -clock clk  0  [get_ports {kernel[841]}]
set_input_delay -clock clk  0  [get_ports {kernel[840]}]
set_input_delay -clock clk  0  [get_ports {kernel[839]}]
set_input_delay -clock clk  0  [get_ports {kernel[838]}]
set_input_delay -clock clk  0  [get_ports {kernel[837]}]
set_input_delay -clock clk  0  [get_ports {kernel[836]}]
set_input_delay -clock clk  0  [get_ports {kernel[835]}]
set_input_delay -clock clk  0  [get_ports {kernel[834]}]
set_input_delay -clock clk  0  [get_ports {kernel[833]}]
set_input_delay -clock clk  0  [get_ports {kernel[832]}]
set_input_delay -clock clk  0  [get_ports {kernel[831]}]
set_input_delay -clock clk  0  [get_ports {kernel[830]}]
set_input_delay -clock clk  0  [get_ports {kernel[829]}]
set_input_delay -clock clk  0  [get_ports {kernel[828]}]
set_input_delay -clock clk  0  [get_ports {kernel[827]}]
set_input_delay -clock clk  0  [get_ports {kernel[826]}]
set_input_delay -clock clk  0  [get_ports {kernel[825]}]
set_input_delay -clock clk  0  [get_ports {kernel[824]}]
set_input_delay -clock clk  0  [get_ports {kernel[823]}]
set_input_delay -clock clk  0  [get_ports {kernel[822]}]
set_input_delay -clock clk  0  [get_ports {kernel[821]}]
set_input_delay -clock clk  0  [get_ports {kernel[820]}]
set_input_delay -clock clk  0  [get_ports {kernel[819]}]
set_input_delay -clock clk  0  [get_ports {kernel[818]}]
set_input_delay -clock clk  0  [get_ports {kernel[817]}]
set_input_delay -clock clk  0  [get_ports {kernel[816]}]
set_input_delay -clock clk  0  [get_ports {kernel[815]}]
set_input_delay -clock clk  0  [get_ports {kernel[814]}]
set_input_delay -clock clk  0  [get_ports {kernel[813]}]
set_input_delay -clock clk  0  [get_ports {kernel[812]}]
set_input_delay -clock clk  0  [get_ports {kernel[811]}]
set_input_delay -clock clk  0  [get_ports {kernel[810]}]
set_input_delay -clock clk  0  [get_ports {kernel[809]}]
set_input_delay -clock clk  0  [get_ports {kernel[808]}]
set_input_delay -clock clk  0  [get_ports {kernel[807]}]
set_input_delay -clock clk  0  [get_ports {kernel[806]}]
set_input_delay -clock clk  0  [get_ports {kernel[805]}]
set_input_delay -clock clk  0  [get_ports {kernel[804]}]
set_input_delay -clock clk  0  [get_ports {kernel[803]}]
set_input_delay -clock clk  0  [get_ports {kernel[802]}]
set_input_delay -clock clk  0  [get_ports {kernel[801]}]
set_input_delay -clock clk  0  [get_ports {kernel[800]}]
set_input_delay -clock clk  0  [get_ports {kernel[799]}]
set_input_delay -clock clk  0  [get_ports {kernel[798]}]
set_input_delay -clock clk  0  [get_ports {kernel[797]}]
set_input_delay -clock clk  0  [get_ports {kernel[796]}]
set_input_delay -clock clk  0  [get_ports {kernel[795]}]
set_input_delay -clock clk  0  [get_ports {kernel[794]}]
set_input_delay -clock clk  0  [get_ports {kernel[793]}]
set_input_delay -clock clk  0  [get_ports {kernel[792]}]
set_input_delay -clock clk  0  [get_ports {kernel[791]}]
set_input_delay -clock clk  0  [get_ports {kernel[790]}]
set_input_delay -clock clk  0  [get_ports {kernel[789]}]
set_input_delay -clock clk  0  [get_ports {kernel[788]}]
set_input_delay -clock clk  0  [get_ports {kernel[787]}]
set_input_delay -clock clk  0  [get_ports {kernel[786]}]
set_input_delay -clock clk  0  [get_ports {kernel[785]}]
set_input_delay -clock clk  0  [get_ports {kernel[784]}]
set_input_delay -clock clk  0  [get_ports {kernel[783]}]
set_input_delay -clock clk  0  [get_ports {kernel[782]}]
set_input_delay -clock clk  0  [get_ports {kernel[781]}]
set_input_delay -clock clk  0  [get_ports {kernel[780]}]
set_input_delay -clock clk  0  [get_ports {kernel[779]}]
set_input_delay -clock clk  0  [get_ports {kernel[778]}]
set_input_delay -clock clk  0  [get_ports {kernel[777]}]
set_input_delay -clock clk  0  [get_ports {kernel[776]}]
set_input_delay -clock clk  0  [get_ports {kernel[775]}]
set_input_delay -clock clk  0  [get_ports {kernel[774]}]
set_input_delay -clock clk  0  [get_ports {kernel[773]}]
set_input_delay -clock clk  0  [get_ports {kernel[772]}]
set_input_delay -clock clk  0  [get_ports {kernel[771]}]
set_input_delay -clock clk  0  [get_ports {kernel[770]}]
set_input_delay -clock clk  0  [get_ports {kernel[769]}]
set_input_delay -clock clk  0  [get_ports {kernel[768]}]
set_input_delay -clock clk  0  [get_ports {kernel[767]}]
set_input_delay -clock clk  0  [get_ports {kernel[766]}]
set_input_delay -clock clk  0  [get_ports {kernel[765]}]
set_input_delay -clock clk  0  [get_ports {kernel[764]}]
set_input_delay -clock clk  0  [get_ports {kernel[763]}]
set_input_delay -clock clk  0  [get_ports {kernel[762]}]
set_input_delay -clock clk  0  [get_ports {kernel[761]}]
set_input_delay -clock clk  0  [get_ports {kernel[760]}]
set_input_delay -clock clk  0  [get_ports {kernel[759]}]
set_input_delay -clock clk  0  [get_ports {kernel[758]}]
set_input_delay -clock clk  0  [get_ports {kernel[757]}]
set_input_delay -clock clk  0  [get_ports {kernel[756]}]
set_input_delay -clock clk  0  [get_ports {kernel[755]}]
set_input_delay -clock clk  0  [get_ports {kernel[754]}]
set_input_delay -clock clk  0  [get_ports {kernel[753]}]
set_input_delay -clock clk  0  [get_ports {kernel[752]}]
set_input_delay -clock clk  0  [get_ports {kernel[751]}]
set_input_delay -clock clk  0  [get_ports {kernel[750]}]
set_input_delay -clock clk  0  [get_ports {kernel[749]}]
set_input_delay -clock clk  0  [get_ports {kernel[748]}]
set_input_delay -clock clk  0  [get_ports {kernel[747]}]
set_input_delay -clock clk  0  [get_ports {kernel[746]}]
set_input_delay -clock clk  0  [get_ports {kernel[745]}]
set_input_delay -clock clk  0  [get_ports {kernel[744]}]
set_input_delay -clock clk  0  [get_ports {kernel[743]}]
set_input_delay -clock clk  0  [get_ports {kernel[742]}]
set_input_delay -clock clk  0  [get_ports {kernel[741]}]
set_input_delay -clock clk  0  [get_ports {kernel[740]}]
set_input_delay -clock clk  0  [get_ports {kernel[739]}]
set_input_delay -clock clk  0  [get_ports {kernel[738]}]
set_input_delay -clock clk  0  [get_ports {kernel[737]}]
set_input_delay -clock clk  0  [get_ports {kernel[736]}]
set_input_delay -clock clk  0  [get_ports {kernel[735]}]
set_input_delay -clock clk  0  [get_ports {kernel[734]}]
set_input_delay -clock clk  0  [get_ports {kernel[733]}]
set_input_delay -clock clk  0  [get_ports {kernel[732]}]
set_input_delay -clock clk  0  [get_ports {kernel[731]}]
set_input_delay -clock clk  0  [get_ports {kernel[730]}]
set_input_delay -clock clk  0  [get_ports {kernel[729]}]
set_input_delay -clock clk  0  [get_ports {kernel[728]}]
set_input_delay -clock clk  0  [get_ports {kernel[727]}]
set_input_delay -clock clk  0  [get_ports {kernel[726]}]
set_input_delay -clock clk  0  [get_ports {kernel[725]}]
set_input_delay -clock clk  0  [get_ports {kernel[724]}]
set_input_delay -clock clk  0  [get_ports {kernel[723]}]
set_input_delay -clock clk  0  [get_ports {kernel[722]}]
set_input_delay -clock clk  0  [get_ports {kernel[721]}]
set_input_delay -clock clk  0  [get_ports {kernel[720]}]
set_input_delay -clock clk  0  [get_ports {kernel[719]}]
set_input_delay -clock clk  0  [get_ports {kernel[718]}]
set_input_delay -clock clk  0  [get_ports {kernel[717]}]
set_input_delay -clock clk  0  [get_ports {kernel[716]}]
set_input_delay -clock clk  0  [get_ports {kernel[715]}]
set_input_delay -clock clk  0  [get_ports {kernel[714]}]
set_input_delay -clock clk  0  [get_ports {kernel[713]}]
set_input_delay -clock clk  0  [get_ports {kernel[712]}]
set_input_delay -clock clk  0  [get_ports {kernel[711]}]
set_input_delay -clock clk  0  [get_ports {kernel[710]}]
set_input_delay -clock clk  0  [get_ports {kernel[709]}]
set_input_delay -clock clk  0  [get_ports {kernel[708]}]
set_input_delay -clock clk  0  [get_ports {kernel[707]}]
set_input_delay -clock clk  0  [get_ports {kernel[706]}]
set_input_delay -clock clk  0  [get_ports {kernel[705]}]
set_input_delay -clock clk  0  [get_ports {kernel[704]}]
set_input_delay -clock clk  0  [get_ports {kernel[703]}]
set_input_delay -clock clk  0  [get_ports {kernel[702]}]
set_input_delay -clock clk  0  [get_ports {kernel[701]}]
set_input_delay -clock clk  0  [get_ports {kernel[700]}]
set_input_delay -clock clk  0  [get_ports {kernel[699]}]
set_input_delay -clock clk  0  [get_ports {kernel[698]}]
set_input_delay -clock clk  0  [get_ports {kernel[697]}]
set_input_delay -clock clk  0  [get_ports {kernel[696]}]
set_input_delay -clock clk  0  [get_ports {kernel[695]}]
set_input_delay -clock clk  0  [get_ports {kernel[694]}]
set_input_delay -clock clk  0  [get_ports {kernel[693]}]
set_input_delay -clock clk  0  [get_ports {kernel[692]}]
set_input_delay -clock clk  0  [get_ports {kernel[691]}]
set_input_delay -clock clk  0  [get_ports {kernel[690]}]
set_input_delay -clock clk  0  [get_ports {kernel[689]}]
set_input_delay -clock clk  0  [get_ports {kernel[688]}]
set_input_delay -clock clk  0  [get_ports {kernel[687]}]
set_input_delay -clock clk  0  [get_ports {kernel[686]}]
set_input_delay -clock clk  0  [get_ports {kernel[685]}]
set_input_delay -clock clk  0  [get_ports {kernel[684]}]
set_input_delay -clock clk  0  [get_ports {kernel[683]}]
set_input_delay -clock clk  0  [get_ports {kernel[682]}]
set_input_delay -clock clk  0  [get_ports {kernel[681]}]
set_input_delay -clock clk  0  [get_ports {kernel[680]}]
set_input_delay -clock clk  0  [get_ports {kernel[679]}]
set_input_delay -clock clk  0  [get_ports {kernel[678]}]
set_input_delay -clock clk  0  [get_ports {kernel[677]}]
set_input_delay -clock clk  0  [get_ports {kernel[676]}]
set_input_delay -clock clk  0  [get_ports {kernel[675]}]
set_input_delay -clock clk  0  [get_ports {kernel[674]}]
set_input_delay -clock clk  0  [get_ports {kernel[673]}]
set_input_delay -clock clk  0  [get_ports {kernel[672]}]
set_input_delay -clock clk  0  [get_ports {kernel[671]}]
set_input_delay -clock clk  0  [get_ports {kernel[670]}]
set_input_delay -clock clk  0  [get_ports {kernel[669]}]
set_input_delay -clock clk  0  [get_ports {kernel[668]}]
set_input_delay -clock clk  0  [get_ports {kernel[667]}]
set_input_delay -clock clk  0  [get_ports {kernel[666]}]
set_input_delay -clock clk  0  [get_ports {kernel[665]}]
set_input_delay -clock clk  0  [get_ports {kernel[664]}]
set_input_delay -clock clk  0  [get_ports {kernel[663]}]
set_input_delay -clock clk  0  [get_ports {kernel[662]}]
set_input_delay -clock clk  0  [get_ports {kernel[661]}]
set_input_delay -clock clk  0  [get_ports {kernel[660]}]
set_input_delay -clock clk  0  [get_ports {kernel[659]}]
set_input_delay -clock clk  0  [get_ports {kernel[658]}]
set_input_delay -clock clk  0  [get_ports {kernel[657]}]
set_input_delay -clock clk  0  [get_ports {kernel[656]}]
set_input_delay -clock clk  0  [get_ports {kernel[655]}]
set_input_delay -clock clk  0  [get_ports {kernel[654]}]
set_input_delay -clock clk  0  [get_ports {kernel[653]}]
set_input_delay -clock clk  0  [get_ports {kernel[652]}]
set_input_delay -clock clk  0  [get_ports {kernel[651]}]
set_input_delay -clock clk  0  [get_ports {kernel[650]}]
set_input_delay -clock clk  0  [get_ports {kernel[649]}]
set_input_delay -clock clk  0  [get_ports {kernel[648]}]
set_input_delay -clock clk  0  [get_ports {kernel[647]}]
set_input_delay -clock clk  0  [get_ports {kernel[646]}]
set_input_delay -clock clk  0  [get_ports {kernel[645]}]
set_input_delay -clock clk  0  [get_ports {kernel[644]}]
set_input_delay -clock clk  0  [get_ports {kernel[643]}]
set_input_delay -clock clk  0  [get_ports {kernel[642]}]
set_input_delay -clock clk  0  [get_ports {kernel[641]}]
set_input_delay -clock clk  0  [get_ports {kernel[640]}]
set_input_delay -clock clk  0  [get_ports {kernel[639]}]
set_input_delay -clock clk  0  [get_ports {kernel[638]}]
set_input_delay -clock clk  0  [get_ports {kernel[637]}]
set_input_delay -clock clk  0  [get_ports {kernel[636]}]
set_input_delay -clock clk  0  [get_ports {kernel[635]}]
set_input_delay -clock clk  0  [get_ports {kernel[634]}]
set_input_delay -clock clk  0  [get_ports {kernel[633]}]
set_input_delay -clock clk  0  [get_ports {kernel[632]}]
set_input_delay -clock clk  0  [get_ports {kernel[631]}]
set_input_delay -clock clk  0  [get_ports {kernel[630]}]
set_input_delay -clock clk  0  [get_ports {kernel[629]}]
set_input_delay -clock clk  0  [get_ports {kernel[628]}]
set_input_delay -clock clk  0  [get_ports {kernel[627]}]
set_input_delay -clock clk  0  [get_ports {kernel[626]}]
set_input_delay -clock clk  0  [get_ports {kernel[625]}]
set_input_delay -clock clk  0  [get_ports {kernel[624]}]
set_input_delay -clock clk  0  [get_ports {kernel[623]}]
set_input_delay -clock clk  0  [get_ports {kernel[622]}]
set_input_delay -clock clk  0  [get_ports {kernel[621]}]
set_input_delay -clock clk  0  [get_ports {kernel[620]}]
set_input_delay -clock clk  0  [get_ports {kernel[619]}]
set_input_delay -clock clk  0  [get_ports {kernel[618]}]
set_input_delay -clock clk  0  [get_ports {kernel[617]}]
set_input_delay -clock clk  0  [get_ports {kernel[616]}]
set_input_delay -clock clk  0  [get_ports {kernel[615]}]
set_input_delay -clock clk  0  [get_ports {kernel[614]}]
set_input_delay -clock clk  0  [get_ports {kernel[613]}]
set_input_delay -clock clk  0  [get_ports {kernel[612]}]
set_input_delay -clock clk  0  [get_ports {kernel[611]}]
set_input_delay -clock clk  0  [get_ports {kernel[610]}]
set_input_delay -clock clk  0  [get_ports {kernel[609]}]
set_input_delay -clock clk  0  [get_ports {kernel[608]}]
set_input_delay -clock clk  0  [get_ports {kernel[607]}]
set_input_delay -clock clk  0  [get_ports {kernel[606]}]
set_input_delay -clock clk  0  [get_ports {kernel[605]}]
set_input_delay -clock clk  0  [get_ports {kernel[604]}]
set_input_delay -clock clk  0  [get_ports {kernel[603]}]
set_input_delay -clock clk  0  [get_ports {kernel[602]}]
set_input_delay -clock clk  0  [get_ports {kernel[601]}]
set_input_delay -clock clk  0  [get_ports {kernel[600]}]
set_input_delay -clock clk  0  [get_ports {kernel[599]}]
set_input_delay -clock clk  0  [get_ports {kernel[598]}]
set_input_delay -clock clk  0  [get_ports {kernel[597]}]
set_input_delay -clock clk  0  [get_ports {kernel[596]}]
set_input_delay -clock clk  0  [get_ports {kernel[595]}]
set_input_delay -clock clk  0  [get_ports {kernel[594]}]
set_input_delay -clock clk  0  [get_ports {kernel[593]}]
set_input_delay -clock clk  0  [get_ports {kernel[592]}]
set_input_delay -clock clk  0  [get_ports {kernel[591]}]
set_input_delay -clock clk  0  [get_ports {kernel[590]}]
set_input_delay -clock clk  0  [get_ports {kernel[589]}]
set_input_delay -clock clk  0  [get_ports {kernel[588]}]
set_input_delay -clock clk  0  [get_ports {kernel[587]}]
set_input_delay -clock clk  0  [get_ports {kernel[586]}]
set_input_delay -clock clk  0  [get_ports {kernel[585]}]
set_input_delay -clock clk  0  [get_ports {kernel[584]}]
set_input_delay -clock clk  0  [get_ports {kernel[583]}]
set_input_delay -clock clk  0  [get_ports {kernel[582]}]
set_input_delay -clock clk  0  [get_ports {kernel[581]}]
set_input_delay -clock clk  0  [get_ports {kernel[580]}]
set_input_delay -clock clk  0  [get_ports {kernel[579]}]
set_input_delay -clock clk  0  [get_ports {kernel[578]}]
set_input_delay -clock clk  0  [get_ports {kernel[577]}]
set_input_delay -clock clk  0  [get_ports {kernel[576]}]
set_input_delay -clock clk  0  [get_ports {kernel[575]}]
set_input_delay -clock clk  0  [get_ports {kernel[574]}]
set_input_delay -clock clk  0  [get_ports {kernel[573]}]
set_input_delay -clock clk  0  [get_ports {kernel[572]}]
set_input_delay -clock clk  0  [get_ports {kernel[571]}]
set_input_delay -clock clk  0  [get_ports {kernel[570]}]
set_input_delay -clock clk  0  [get_ports {kernel[569]}]
set_input_delay -clock clk  0  [get_ports {kernel[568]}]
set_input_delay -clock clk  0  [get_ports {kernel[567]}]
set_input_delay -clock clk  0  [get_ports {kernel[566]}]
set_input_delay -clock clk  0  [get_ports {kernel[565]}]
set_input_delay -clock clk  0  [get_ports {kernel[564]}]
set_input_delay -clock clk  0  [get_ports {kernel[563]}]
set_input_delay -clock clk  0  [get_ports {kernel[562]}]
set_input_delay -clock clk  0  [get_ports {kernel[561]}]
set_input_delay -clock clk  0  [get_ports {kernel[560]}]
set_input_delay -clock clk  0  [get_ports {kernel[559]}]
set_input_delay -clock clk  0  [get_ports {kernel[558]}]
set_input_delay -clock clk  0  [get_ports {kernel[557]}]
set_input_delay -clock clk  0  [get_ports {kernel[556]}]
set_input_delay -clock clk  0  [get_ports {kernel[555]}]
set_input_delay -clock clk  0  [get_ports {kernel[554]}]
set_input_delay -clock clk  0  [get_ports {kernel[553]}]
set_input_delay -clock clk  0  [get_ports {kernel[552]}]
set_input_delay -clock clk  0  [get_ports {kernel[551]}]
set_input_delay -clock clk  0  [get_ports {kernel[550]}]
set_input_delay -clock clk  0  [get_ports {kernel[549]}]
set_input_delay -clock clk  0  [get_ports {kernel[548]}]
set_input_delay -clock clk  0  [get_ports {kernel[547]}]
set_input_delay -clock clk  0  [get_ports {kernel[546]}]
set_input_delay -clock clk  0  [get_ports {kernel[545]}]
set_input_delay -clock clk  0  [get_ports {kernel[544]}]
set_input_delay -clock clk  0  [get_ports {kernel[543]}]
set_input_delay -clock clk  0  [get_ports {kernel[542]}]
set_input_delay -clock clk  0  [get_ports {kernel[541]}]
set_input_delay -clock clk  0  [get_ports {kernel[540]}]
set_input_delay -clock clk  0  [get_ports {kernel[539]}]
set_input_delay -clock clk  0  [get_ports {kernel[538]}]
set_input_delay -clock clk  0  [get_ports {kernel[537]}]
set_input_delay -clock clk  0  [get_ports {kernel[536]}]
set_input_delay -clock clk  0  [get_ports {kernel[535]}]
set_input_delay -clock clk  0  [get_ports {kernel[534]}]
set_input_delay -clock clk  0  [get_ports {kernel[533]}]
set_input_delay -clock clk  0  [get_ports {kernel[532]}]
set_input_delay -clock clk  0  [get_ports {kernel[531]}]
set_input_delay -clock clk  0  [get_ports {kernel[530]}]
set_input_delay -clock clk  0  [get_ports {kernel[529]}]
set_input_delay -clock clk  0  [get_ports {kernel[528]}]
set_input_delay -clock clk  0  [get_ports {kernel[527]}]
set_input_delay -clock clk  0  [get_ports {kernel[526]}]
set_input_delay -clock clk  0  [get_ports {kernel[525]}]
set_input_delay -clock clk  0  [get_ports {kernel[524]}]
set_input_delay -clock clk  0  [get_ports {kernel[523]}]
set_input_delay -clock clk  0  [get_ports {kernel[522]}]
set_input_delay -clock clk  0  [get_ports {kernel[521]}]
set_input_delay -clock clk  0  [get_ports {kernel[520]}]
set_input_delay -clock clk  0  [get_ports {kernel[519]}]
set_input_delay -clock clk  0  [get_ports {kernel[518]}]
set_input_delay -clock clk  0  [get_ports {kernel[517]}]
set_input_delay -clock clk  0  [get_ports {kernel[516]}]
set_input_delay -clock clk  0  [get_ports {kernel[515]}]
set_input_delay -clock clk  0  [get_ports {kernel[514]}]
set_input_delay -clock clk  0  [get_ports {kernel[513]}]
set_input_delay -clock clk  0  [get_ports {kernel[512]}]
set_input_delay -clock clk  0  [get_ports {kernel[511]}]
set_input_delay -clock clk  0  [get_ports {kernel[510]}]
set_input_delay -clock clk  0  [get_ports {kernel[509]}]
set_input_delay -clock clk  0  [get_ports {kernel[508]}]
set_input_delay -clock clk  0  [get_ports {kernel[507]}]
set_input_delay -clock clk  0  [get_ports {kernel[506]}]
set_input_delay -clock clk  0  [get_ports {kernel[505]}]
set_input_delay -clock clk  0  [get_ports {kernel[504]}]
set_input_delay -clock clk  0  [get_ports {kernel[503]}]
set_input_delay -clock clk  0  [get_ports {kernel[502]}]
set_input_delay -clock clk  0  [get_ports {kernel[501]}]
set_input_delay -clock clk  0  [get_ports {kernel[500]}]
set_input_delay -clock clk  0  [get_ports {kernel[499]}]
set_input_delay -clock clk  0  [get_ports {kernel[498]}]
set_input_delay -clock clk  0  [get_ports {kernel[497]}]
set_input_delay -clock clk  0  [get_ports {kernel[496]}]
set_input_delay -clock clk  0  [get_ports {kernel[495]}]
set_input_delay -clock clk  0  [get_ports {kernel[494]}]
set_input_delay -clock clk  0  [get_ports {kernel[493]}]
set_input_delay -clock clk  0  [get_ports {kernel[492]}]
set_input_delay -clock clk  0  [get_ports {kernel[491]}]
set_input_delay -clock clk  0  [get_ports {kernel[490]}]
set_input_delay -clock clk  0  [get_ports {kernel[489]}]
set_input_delay -clock clk  0  [get_ports {kernel[488]}]
set_input_delay -clock clk  0  [get_ports {kernel[487]}]
set_input_delay -clock clk  0  [get_ports {kernel[486]}]
set_input_delay -clock clk  0  [get_ports {kernel[485]}]
set_input_delay -clock clk  0  [get_ports {kernel[484]}]
set_input_delay -clock clk  0  [get_ports {kernel[483]}]
set_input_delay -clock clk  0  [get_ports {kernel[482]}]
set_input_delay -clock clk  0  [get_ports {kernel[481]}]
set_input_delay -clock clk  0  [get_ports {kernel[480]}]
set_input_delay -clock clk  0  [get_ports {kernel[479]}]
set_input_delay -clock clk  0  [get_ports {kernel[478]}]
set_input_delay -clock clk  0  [get_ports {kernel[477]}]
set_input_delay -clock clk  0  [get_ports {kernel[476]}]
set_input_delay -clock clk  0  [get_ports {kernel[475]}]
set_input_delay -clock clk  0  [get_ports {kernel[474]}]
set_input_delay -clock clk  0  [get_ports {kernel[473]}]
set_input_delay -clock clk  0  [get_ports {kernel[472]}]
set_input_delay -clock clk  0  [get_ports {kernel[471]}]
set_input_delay -clock clk  0  [get_ports {kernel[470]}]
set_input_delay -clock clk  0  [get_ports {kernel[469]}]
set_input_delay -clock clk  0  [get_ports {kernel[468]}]
set_input_delay -clock clk  0  [get_ports {kernel[467]}]
set_input_delay -clock clk  0  [get_ports {kernel[466]}]
set_input_delay -clock clk  0  [get_ports {kernel[465]}]
set_input_delay -clock clk  0  [get_ports {kernel[464]}]
set_input_delay -clock clk  0  [get_ports {kernel[463]}]
set_input_delay -clock clk  0  [get_ports {kernel[462]}]
set_input_delay -clock clk  0  [get_ports {kernel[461]}]
set_input_delay -clock clk  0  [get_ports {kernel[460]}]
set_input_delay -clock clk  0  [get_ports {kernel[459]}]
set_input_delay -clock clk  0  [get_ports {kernel[458]}]
set_input_delay -clock clk  0  [get_ports {kernel[457]}]
set_input_delay -clock clk  0  [get_ports {kernel[456]}]
set_input_delay -clock clk  0  [get_ports {kernel[455]}]
set_input_delay -clock clk  0  [get_ports {kernel[454]}]
set_input_delay -clock clk  0  [get_ports {kernel[453]}]
set_input_delay -clock clk  0  [get_ports {kernel[452]}]
set_input_delay -clock clk  0  [get_ports {kernel[451]}]
set_input_delay -clock clk  0  [get_ports {kernel[450]}]
set_input_delay -clock clk  0  [get_ports {kernel[449]}]
set_input_delay -clock clk  0  [get_ports {kernel[448]}]
set_input_delay -clock clk  0  [get_ports {kernel[447]}]
set_input_delay -clock clk  0  [get_ports {kernel[446]}]
set_input_delay -clock clk  0  [get_ports {kernel[445]}]
set_input_delay -clock clk  0  [get_ports {kernel[444]}]
set_input_delay -clock clk  0  [get_ports {kernel[443]}]
set_input_delay -clock clk  0  [get_ports {kernel[442]}]
set_input_delay -clock clk  0  [get_ports {kernel[441]}]
set_input_delay -clock clk  0  [get_ports {kernel[440]}]
set_input_delay -clock clk  0  [get_ports {kernel[439]}]
set_input_delay -clock clk  0  [get_ports {kernel[438]}]
set_input_delay -clock clk  0  [get_ports {kernel[437]}]
set_input_delay -clock clk  0  [get_ports {kernel[436]}]
set_input_delay -clock clk  0  [get_ports {kernel[435]}]
set_input_delay -clock clk  0  [get_ports {kernel[434]}]
set_input_delay -clock clk  0  [get_ports {kernel[433]}]
set_input_delay -clock clk  0  [get_ports {kernel[432]}]
set_input_delay -clock clk  0  [get_ports {kernel[431]}]
set_input_delay -clock clk  0  [get_ports {kernel[430]}]
set_input_delay -clock clk  0  [get_ports {kernel[429]}]
set_input_delay -clock clk  0  [get_ports {kernel[428]}]
set_input_delay -clock clk  0  [get_ports {kernel[427]}]
set_input_delay -clock clk  0  [get_ports {kernel[426]}]
set_input_delay -clock clk  0  [get_ports {kernel[425]}]
set_input_delay -clock clk  0  [get_ports {kernel[424]}]
set_input_delay -clock clk  0  [get_ports {kernel[423]}]
set_input_delay -clock clk  0  [get_ports {kernel[422]}]
set_input_delay -clock clk  0  [get_ports {kernel[421]}]
set_input_delay -clock clk  0  [get_ports {kernel[420]}]
set_input_delay -clock clk  0  [get_ports {kernel[419]}]
set_input_delay -clock clk  0  [get_ports {kernel[418]}]
set_input_delay -clock clk  0  [get_ports {kernel[417]}]
set_input_delay -clock clk  0  [get_ports {kernel[416]}]
set_input_delay -clock clk  0  [get_ports {kernel[415]}]
set_input_delay -clock clk  0  [get_ports {kernel[414]}]
set_input_delay -clock clk  0  [get_ports {kernel[413]}]
set_input_delay -clock clk  0  [get_ports {kernel[412]}]
set_input_delay -clock clk  0  [get_ports {kernel[411]}]
set_input_delay -clock clk  0  [get_ports {kernel[410]}]
set_input_delay -clock clk  0  [get_ports {kernel[409]}]
set_input_delay -clock clk  0  [get_ports {kernel[408]}]
set_input_delay -clock clk  0  [get_ports {kernel[407]}]
set_input_delay -clock clk  0  [get_ports {kernel[406]}]
set_input_delay -clock clk  0  [get_ports {kernel[405]}]
set_input_delay -clock clk  0  [get_ports {kernel[404]}]
set_input_delay -clock clk  0  [get_ports {kernel[403]}]
set_input_delay -clock clk  0  [get_ports {kernel[402]}]
set_input_delay -clock clk  0  [get_ports {kernel[401]}]
set_input_delay -clock clk  0  [get_ports {kernel[400]}]
set_input_delay -clock clk  0  [get_ports {kernel[399]}]
set_input_delay -clock clk  0  [get_ports {kernel[398]}]
set_input_delay -clock clk  0  [get_ports {kernel[397]}]
set_input_delay -clock clk  0  [get_ports {kernel[396]}]
set_input_delay -clock clk  0  [get_ports {kernel[395]}]
set_input_delay -clock clk  0  [get_ports {kernel[394]}]
set_input_delay -clock clk  0  [get_ports {kernel[393]}]
set_input_delay -clock clk  0  [get_ports {kernel[392]}]
set_input_delay -clock clk  0  [get_ports {kernel[391]}]
set_input_delay -clock clk  0  [get_ports {kernel[390]}]
set_input_delay -clock clk  0  [get_ports {kernel[389]}]
set_input_delay -clock clk  0  [get_ports {kernel[388]}]
set_input_delay -clock clk  0  [get_ports {kernel[387]}]
set_input_delay -clock clk  0  [get_ports {kernel[386]}]
set_input_delay -clock clk  0  [get_ports {kernel[385]}]
set_input_delay -clock clk  0  [get_ports {kernel[384]}]
set_input_delay -clock clk  0  [get_ports {kernel[383]}]
set_input_delay -clock clk  0  [get_ports {kernel[382]}]
set_input_delay -clock clk  0  [get_ports {kernel[381]}]
set_input_delay -clock clk  0  [get_ports {kernel[380]}]
set_input_delay -clock clk  0  [get_ports {kernel[379]}]
set_input_delay -clock clk  0  [get_ports {kernel[378]}]
set_input_delay -clock clk  0  [get_ports {kernel[377]}]
set_input_delay -clock clk  0  [get_ports {kernel[376]}]
set_input_delay -clock clk  0  [get_ports {kernel[375]}]
set_input_delay -clock clk  0  [get_ports {kernel[374]}]
set_input_delay -clock clk  0  [get_ports {kernel[373]}]
set_input_delay -clock clk  0  [get_ports {kernel[372]}]
set_input_delay -clock clk  0  [get_ports {kernel[371]}]
set_input_delay -clock clk  0  [get_ports {kernel[370]}]
set_input_delay -clock clk  0  [get_ports {kernel[369]}]
set_input_delay -clock clk  0  [get_ports {kernel[368]}]
set_input_delay -clock clk  0  [get_ports {kernel[367]}]
set_input_delay -clock clk  0  [get_ports {kernel[366]}]
set_input_delay -clock clk  0  [get_ports {kernel[365]}]
set_input_delay -clock clk  0  [get_ports {kernel[364]}]
set_input_delay -clock clk  0  [get_ports {kernel[363]}]
set_input_delay -clock clk  0  [get_ports {kernel[362]}]
set_input_delay -clock clk  0  [get_ports {kernel[361]}]
set_input_delay -clock clk  0  [get_ports {kernel[360]}]
set_input_delay -clock clk  0  [get_ports {kernel[359]}]
set_input_delay -clock clk  0  [get_ports {kernel[358]}]
set_input_delay -clock clk  0  [get_ports {kernel[357]}]
set_input_delay -clock clk  0  [get_ports {kernel[356]}]
set_input_delay -clock clk  0  [get_ports {kernel[355]}]
set_input_delay -clock clk  0  [get_ports {kernel[354]}]
set_input_delay -clock clk  0  [get_ports {kernel[353]}]
set_input_delay -clock clk  0  [get_ports {kernel[352]}]
set_input_delay -clock clk  0  [get_ports {kernel[351]}]
set_input_delay -clock clk  0  [get_ports {kernel[350]}]
set_input_delay -clock clk  0  [get_ports {kernel[349]}]
set_input_delay -clock clk  0  [get_ports {kernel[348]}]
set_input_delay -clock clk  0  [get_ports {kernel[347]}]
set_input_delay -clock clk  0  [get_ports {kernel[346]}]
set_input_delay -clock clk  0  [get_ports {kernel[345]}]
set_input_delay -clock clk  0  [get_ports {kernel[344]}]
set_input_delay -clock clk  0  [get_ports {kernel[343]}]
set_input_delay -clock clk  0  [get_ports {kernel[342]}]
set_input_delay -clock clk  0  [get_ports {kernel[341]}]
set_input_delay -clock clk  0  [get_ports {kernel[340]}]
set_input_delay -clock clk  0  [get_ports {kernel[339]}]
set_input_delay -clock clk  0  [get_ports {kernel[338]}]
set_input_delay -clock clk  0  [get_ports {kernel[337]}]
set_input_delay -clock clk  0  [get_ports {kernel[336]}]
set_input_delay -clock clk  0  [get_ports {kernel[335]}]
set_input_delay -clock clk  0  [get_ports {kernel[334]}]
set_input_delay -clock clk  0  [get_ports {kernel[333]}]
set_input_delay -clock clk  0  [get_ports {kernel[332]}]
set_input_delay -clock clk  0  [get_ports {kernel[331]}]
set_input_delay -clock clk  0  [get_ports {kernel[330]}]
set_input_delay -clock clk  0  [get_ports {kernel[329]}]
set_input_delay -clock clk  0  [get_ports {kernel[328]}]
set_input_delay -clock clk  0  [get_ports {kernel[327]}]
set_input_delay -clock clk  0  [get_ports {kernel[326]}]
set_input_delay -clock clk  0  [get_ports {kernel[325]}]
set_input_delay -clock clk  0  [get_ports {kernel[324]}]
set_input_delay -clock clk  0  [get_ports {kernel[323]}]
set_input_delay -clock clk  0  [get_ports {kernel[322]}]
set_input_delay -clock clk  0  [get_ports {kernel[321]}]
set_input_delay -clock clk  0  [get_ports {kernel[320]}]
set_input_delay -clock clk  0  [get_ports {kernel[319]}]
set_input_delay -clock clk  0  [get_ports {kernel[318]}]
set_input_delay -clock clk  0  [get_ports {kernel[317]}]
set_input_delay -clock clk  0  [get_ports {kernel[316]}]
set_input_delay -clock clk  0  [get_ports {kernel[315]}]
set_input_delay -clock clk  0  [get_ports {kernel[314]}]
set_input_delay -clock clk  0  [get_ports {kernel[313]}]
set_input_delay -clock clk  0  [get_ports {kernel[312]}]
set_input_delay -clock clk  0  [get_ports {kernel[311]}]
set_input_delay -clock clk  0  [get_ports {kernel[310]}]
set_input_delay -clock clk  0  [get_ports {kernel[309]}]
set_input_delay -clock clk  0  [get_ports {kernel[308]}]
set_input_delay -clock clk  0  [get_ports {kernel[307]}]
set_input_delay -clock clk  0  [get_ports {kernel[306]}]
set_input_delay -clock clk  0  [get_ports {kernel[305]}]
set_input_delay -clock clk  0  [get_ports {kernel[304]}]
set_input_delay -clock clk  0  [get_ports {kernel[303]}]
set_input_delay -clock clk  0  [get_ports {kernel[302]}]
set_input_delay -clock clk  0  [get_ports {kernel[301]}]
set_input_delay -clock clk  0  [get_ports {kernel[300]}]
set_input_delay -clock clk  0  [get_ports {kernel[299]}]
set_input_delay -clock clk  0  [get_ports {kernel[298]}]
set_input_delay -clock clk  0  [get_ports {kernel[297]}]
set_input_delay -clock clk  0  [get_ports {kernel[296]}]
set_input_delay -clock clk  0  [get_ports {kernel[295]}]
set_input_delay -clock clk  0  [get_ports {kernel[294]}]
set_input_delay -clock clk  0  [get_ports {kernel[293]}]
set_input_delay -clock clk  0  [get_ports {kernel[292]}]
set_input_delay -clock clk  0  [get_ports {kernel[291]}]
set_input_delay -clock clk  0  [get_ports {kernel[290]}]
set_input_delay -clock clk  0  [get_ports {kernel[289]}]
set_input_delay -clock clk  0  [get_ports {kernel[288]}]
set_input_delay -clock clk  0  [get_ports {kernel[287]}]
set_input_delay -clock clk  0  [get_ports {kernel[286]}]
set_input_delay -clock clk  0  [get_ports {kernel[285]}]
set_input_delay -clock clk  0  [get_ports {kernel[284]}]
set_input_delay -clock clk  0  [get_ports {kernel[283]}]
set_input_delay -clock clk  0  [get_ports {kernel[282]}]
set_input_delay -clock clk  0  [get_ports {kernel[281]}]
set_input_delay -clock clk  0  [get_ports {kernel[280]}]
set_input_delay -clock clk  0  [get_ports {kernel[279]}]
set_input_delay -clock clk  0  [get_ports {kernel[278]}]
set_input_delay -clock clk  0  [get_ports {kernel[277]}]
set_input_delay -clock clk  0  [get_ports {kernel[276]}]
set_input_delay -clock clk  0  [get_ports {kernel[275]}]
set_input_delay -clock clk  0  [get_ports {kernel[274]}]
set_input_delay -clock clk  0  [get_ports {kernel[273]}]
set_input_delay -clock clk  0  [get_ports {kernel[272]}]
set_input_delay -clock clk  0  [get_ports {kernel[271]}]
set_input_delay -clock clk  0  [get_ports {kernel[270]}]
set_input_delay -clock clk  0  [get_ports {kernel[269]}]
set_input_delay -clock clk  0  [get_ports {kernel[268]}]
set_input_delay -clock clk  0  [get_ports {kernel[267]}]
set_input_delay -clock clk  0  [get_ports {kernel[266]}]
set_input_delay -clock clk  0  [get_ports {kernel[265]}]
set_input_delay -clock clk  0  [get_ports {kernel[264]}]
set_input_delay -clock clk  0  [get_ports {kernel[263]}]
set_input_delay -clock clk  0  [get_ports {kernel[262]}]
set_input_delay -clock clk  0  [get_ports {kernel[261]}]
set_input_delay -clock clk  0  [get_ports {kernel[260]}]
set_input_delay -clock clk  0  [get_ports {kernel[259]}]
set_input_delay -clock clk  0  [get_ports {kernel[258]}]
set_input_delay -clock clk  0  [get_ports {kernel[257]}]
set_input_delay -clock clk  0  [get_ports {kernel[256]}]
set_input_delay -clock clk  0  [get_ports {kernel[255]}]
set_input_delay -clock clk  0  [get_ports {kernel[254]}]
set_input_delay -clock clk  0  [get_ports {kernel[253]}]
set_input_delay -clock clk  0  [get_ports {kernel[252]}]
set_input_delay -clock clk  0  [get_ports {kernel[251]}]
set_input_delay -clock clk  0  [get_ports {kernel[250]}]
set_input_delay -clock clk  0  [get_ports {kernel[249]}]
set_input_delay -clock clk  0  [get_ports {kernel[248]}]
set_input_delay -clock clk  0  [get_ports {kernel[247]}]
set_input_delay -clock clk  0  [get_ports {kernel[246]}]
set_input_delay -clock clk  0  [get_ports {kernel[245]}]
set_input_delay -clock clk  0  [get_ports {kernel[244]}]
set_input_delay -clock clk  0  [get_ports {kernel[243]}]
set_input_delay -clock clk  0  [get_ports {kernel[242]}]
set_input_delay -clock clk  0  [get_ports {kernel[241]}]
set_input_delay -clock clk  0  [get_ports {kernel[240]}]
set_input_delay -clock clk  0  [get_ports {kernel[239]}]
set_input_delay -clock clk  0  [get_ports {kernel[238]}]
set_input_delay -clock clk  0  [get_ports {kernel[237]}]
set_input_delay -clock clk  0  [get_ports {kernel[236]}]
set_input_delay -clock clk  0  [get_ports {kernel[235]}]
set_input_delay -clock clk  0  [get_ports {kernel[234]}]
set_input_delay -clock clk  0  [get_ports {kernel[233]}]
set_input_delay -clock clk  0  [get_ports {kernel[232]}]
set_input_delay -clock clk  0  [get_ports {kernel[231]}]
set_input_delay -clock clk  0  [get_ports {kernel[230]}]
set_input_delay -clock clk  0  [get_ports {kernel[229]}]
set_input_delay -clock clk  0  [get_ports {kernel[228]}]
set_input_delay -clock clk  0  [get_ports {kernel[227]}]
set_input_delay -clock clk  0  [get_ports {kernel[226]}]
set_input_delay -clock clk  0  [get_ports {kernel[225]}]
set_input_delay -clock clk  0  [get_ports {kernel[224]}]
set_input_delay -clock clk  0  [get_ports {kernel[223]}]
set_input_delay -clock clk  0  [get_ports {kernel[222]}]
set_input_delay -clock clk  0  [get_ports {kernel[221]}]
set_input_delay -clock clk  0  [get_ports {kernel[220]}]
set_input_delay -clock clk  0  [get_ports {kernel[219]}]
set_input_delay -clock clk  0  [get_ports {kernel[218]}]
set_input_delay -clock clk  0  [get_ports {kernel[217]}]
set_input_delay -clock clk  0  [get_ports {kernel[216]}]
set_input_delay -clock clk  0  [get_ports {kernel[215]}]
set_input_delay -clock clk  0  [get_ports {kernel[214]}]
set_input_delay -clock clk  0  [get_ports {kernel[213]}]
set_input_delay -clock clk  0  [get_ports {kernel[212]}]
set_input_delay -clock clk  0  [get_ports {kernel[211]}]
set_input_delay -clock clk  0  [get_ports {kernel[210]}]
set_input_delay -clock clk  0  [get_ports {kernel[209]}]
set_input_delay -clock clk  0  [get_ports {kernel[208]}]
set_input_delay -clock clk  0  [get_ports {kernel[207]}]
set_input_delay -clock clk  0  [get_ports {kernel[206]}]
set_input_delay -clock clk  0  [get_ports {kernel[205]}]
set_input_delay -clock clk  0  [get_ports {kernel[204]}]
set_input_delay -clock clk  0  [get_ports {kernel[203]}]
set_input_delay -clock clk  0  [get_ports {kernel[202]}]
set_input_delay -clock clk  0  [get_ports {kernel[201]}]
set_input_delay -clock clk  0  [get_ports {kernel[200]}]
set_input_delay -clock clk  0  [get_ports {kernel[199]}]
set_input_delay -clock clk  0  [get_ports {kernel[198]}]
set_input_delay -clock clk  0  [get_ports {kernel[197]}]
set_input_delay -clock clk  0  [get_ports {kernel[196]}]
set_input_delay -clock clk  0  [get_ports {kernel[195]}]
set_input_delay -clock clk  0  [get_ports {kernel[194]}]
set_input_delay -clock clk  0  [get_ports {kernel[193]}]
set_input_delay -clock clk  0  [get_ports {kernel[192]}]
set_input_delay -clock clk  0  [get_ports {kernel[191]}]
set_input_delay -clock clk  0  [get_ports {kernel[190]}]
set_input_delay -clock clk  0  [get_ports {kernel[189]}]
set_input_delay -clock clk  0  [get_ports {kernel[188]}]
set_input_delay -clock clk  0  [get_ports {kernel[187]}]
set_input_delay -clock clk  0  [get_ports {kernel[186]}]
set_input_delay -clock clk  0  [get_ports {kernel[185]}]
set_input_delay -clock clk  0  [get_ports {kernel[184]}]
set_input_delay -clock clk  0  [get_ports {kernel[183]}]
set_input_delay -clock clk  0  [get_ports {kernel[182]}]
set_input_delay -clock clk  0  [get_ports {kernel[181]}]
set_input_delay -clock clk  0  [get_ports {kernel[180]}]
set_input_delay -clock clk  0  [get_ports {kernel[179]}]
set_input_delay -clock clk  0  [get_ports {kernel[178]}]
set_input_delay -clock clk  0  [get_ports {kernel[177]}]
set_input_delay -clock clk  0  [get_ports {kernel[176]}]
set_input_delay -clock clk  0  [get_ports {kernel[175]}]
set_input_delay -clock clk  0  [get_ports {kernel[174]}]
set_input_delay -clock clk  0  [get_ports {kernel[173]}]
set_input_delay -clock clk  0  [get_ports {kernel[172]}]
set_input_delay -clock clk  0  [get_ports {kernel[171]}]
set_input_delay -clock clk  0  [get_ports {kernel[170]}]
set_input_delay -clock clk  0  [get_ports {kernel[169]}]
set_input_delay -clock clk  0  [get_ports {kernel[168]}]
set_input_delay -clock clk  0  [get_ports {kernel[167]}]
set_input_delay -clock clk  0  [get_ports {kernel[166]}]
set_input_delay -clock clk  0  [get_ports {kernel[165]}]
set_input_delay -clock clk  0  [get_ports {kernel[164]}]
set_input_delay -clock clk  0  [get_ports {kernel[163]}]
set_input_delay -clock clk  0  [get_ports {kernel[162]}]
set_input_delay -clock clk  0  [get_ports {kernel[161]}]
set_input_delay -clock clk  0  [get_ports {kernel[160]}]
set_input_delay -clock clk  0  [get_ports {kernel[159]}]
set_input_delay -clock clk  0  [get_ports {kernel[158]}]
set_input_delay -clock clk  0  [get_ports {kernel[157]}]
set_input_delay -clock clk  0  [get_ports {kernel[156]}]
set_input_delay -clock clk  0  [get_ports {kernel[155]}]
set_input_delay -clock clk  0  [get_ports {kernel[154]}]
set_input_delay -clock clk  0  [get_ports {kernel[153]}]
set_input_delay -clock clk  0  [get_ports {kernel[152]}]
set_input_delay -clock clk  0  [get_ports {kernel[151]}]
set_input_delay -clock clk  0  [get_ports {kernel[150]}]
set_input_delay -clock clk  0  [get_ports {kernel[149]}]
set_input_delay -clock clk  0  [get_ports {kernel[148]}]
set_input_delay -clock clk  0  [get_ports {kernel[147]}]
set_input_delay -clock clk  0  [get_ports {kernel[146]}]
set_input_delay -clock clk  0  [get_ports {kernel[145]}]
set_input_delay -clock clk  0  [get_ports {kernel[144]}]
set_input_delay -clock clk  0  [get_ports {kernel[143]}]
set_input_delay -clock clk  0  [get_ports {kernel[142]}]
set_input_delay -clock clk  0  [get_ports {kernel[141]}]
set_input_delay -clock clk  0  [get_ports {kernel[140]}]
set_input_delay -clock clk  0  [get_ports {kernel[139]}]
set_input_delay -clock clk  0  [get_ports {kernel[138]}]
set_input_delay -clock clk  0  [get_ports {kernel[137]}]
set_input_delay -clock clk  0  [get_ports {kernel[136]}]
set_input_delay -clock clk  0  [get_ports {kernel[135]}]
set_input_delay -clock clk  0  [get_ports {kernel[134]}]
set_input_delay -clock clk  0  [get_ports {kernel[133]}]
set_input_delay -clock clk  0  [get_ports {kernel[132]}]
set_input_delay -clock clk  0  [get_ports {kernel[131]}]
set_input_delay -clock clk  0  [get_ports {kernel[130]}]
set_input_delay -clock clk  0  [get_ports {kernel[129]}]
set_input_delay -clock clk  0  [get_ports {kernel[128]}]
set_input_delay -clock clk  0  [get_ports {kernel[127]}]
set_input_delay -clock clk  0  [get_ports {kernel[126]}]
set_input_delay -clock clk  0  [get_ports {kernel[125]}]
set_input_delay -clock clk  0  [get_ports {kernel[124]}]
set_input_delay -clock clk  0  [get_ports {kernel[123]}]
set_input_delay -clock clk  0  [get_ports {kernel[122]}]
set_input_delay -clock clk  0  [get_ports {kernel[121]}]
set_input_delay -clock clk  0  [get_ports {kernel[120]}]
set_input_delay -clock clk  0  [get_ports {kernel[119]}]
set_input_delay -clock clk  0  [get_ports {kernel[118]}]
set_input_delay -clock clk  0  [get_ports {kernel[117]}]
set_input_delay -clock clk  0  [get_ports {kernel[116]}]
set_input_delay -clock clk  0  [get_ports {kernel[115]}]
set_input_delay -clock clk  0  [get_ports {kernel[114]}]
set_input_delay -clock clk  0  [get_ports {kernel[113]}]
set_input_delay -clock clk  0  [get_ports {kernel[112]}]
set_input_delay -clock clk  0  [get_ports {kernel[111]}]
set_input_delay -clock clk  0  [get_ports {kernel[110]}]
set_input_delay -clock clk  0  [get_ports {kernel[109]}]
set_input_delay -clock clk  0  [get_ports {kernel[108]}]
set_input_delay -clock clk  0  [get_ports {kernel[107]}]
set_input_delay -clock clk  0  [get_ports {kernel[106]}]
set_input_delay -clock clk  0  [get_ports {kernel[105]}]
set_input_delay -clock clk  0  [get_ports {kernel[104]}]
set_input_delay -clock clk  0  [get_ports {kernel[103]}]
set_input_delay -clock clk  0  [get_ports {kernel[102]}]
set_input_delay -clock clk  0  [get_ports {kernel[101]}]
set_input_delay -clock clk  0  [get_ports {kernel[100]}]
set_input_delay -clock clk  0  [get_ports {kernel[99]}]
set_input_delay -clock clk  0  [get_ports {kernel[98]}]
set_input_delay -clock clk  0  [get_ports {kernel[97]}]
set_input_delay -clock clk  0  [get_ports {kernel[96]}]
set_input_delay -clock clk  0  [get_ports {kernel[95]}]
set_input_delay -clock clk  0  [get_ports {kernel[94]}]
set_input_delay -clock clk  0  [get_ports {kernel[93]}]
set_input_delay -clock clk  0  [get_ports {kernel[92]}]
set_input_delay -clock clk  0  [get_ports {kernel[91]}]
set_input_delay -clock clk  0  [get_ports {kernel[90]}]
set_input_delay -clock clk  0  [get_ports {kernel[89]}]
set_input_delay -clock clk  0  [get_ports {kernel[88]}]
set_input_delay -clock clk  0  [get_ports {kernel[87]}]
set_input_delay -clock clk  0  [get_ports {kernel[86]}]
set_input_delay -clock clk  0  [get_ports {kernel[85]}]
set_input_delay -clock clk  0  [get_ports {kernel[84]}]
set_input_delay -clock clk  0  [get_ports {kernel[83]}]
set_input_delay -clock clk  0  [get_ports {kernel[82]}]
set_input_delay -clock clk  0  [get_ports {kernel[81]}]
set_input_delay -clock clk  0  [get_ports {kernel[80]}]
set_input_delay -clock clk  0  [get_ports {kernel[79]}]
set_input_delay -clock clk  0  [get_ports {kernel[78]}]
set_input_delay -clock clk  0  [get_ports {kernel[77]}]
set_input_delay -clock clk  0  [get_ports {kernel[76]}]
set_input_delay -clock clk  0  [get_ports {kernel[75]}]
set_input_delay -clock clk  0  [get_ports {kernel[74]}]
set_input_delay -clock clk  0  [get_ports {kernel[73]}]
set_input_delay -clock clk  0  [get_ports {kernel[72]}]
set_input_delay -clock clk  0  [get_ports {kernel[71]}]
set_input_delay -clock clk  0  [get_ports {kernel[70]}]
set_input_delay -clock clk  0  [get_ports {kernel[69]}]
set_input_delay -clock clk  0  [get_ports {kernel[68]}]
set_input_delay -clock clk  0  [get_ports {kernel[67]}]
set_input_delay -clock clk  0  [get_ports {kernel[66]}]
set_input_delay -clock clk  0  [get_ports {kernel[65]}]
set_input_delay -clock clk  0  [get_ports {kernel[64]}]
set_input_delay -clock clk  0  [get_ports {kernel[63]}]
set_input_delay -clock clk  0  [get_ports {kernel[62]}]
set_input_delay -clock clk  0  [get_ports {kernel[61]}]
set_input_delay -clock clk  0  [get_ports {kernel[60]}]
set_input_delay -clock clk  0  [get_ports {kernel[59]}]
set_input_delay -clock clk  0  [get_ports {kernel[58]}]
set_input_delay -clock clk  0  [get_ports {kernel[57]}]
set_input_delay -clock clk  0  [get_ports {kernel[56]}]
set_input_delay -clock clk  0  [get_ports {kernel[55]}]
set_input_delay -clock clk  0  [get_ports {kernel[54]}]
set_input_delay -clock clk  0  [get_ports {kernel[53]}]
set_input_delay -clock clk  0  [get_ports {kernel[52]}]
set_input_delay -clock clk  0  [get_ports {kernel[51]}]
set_input_delay -clock clk  0  [get_ports {kernel[50]}]
set_input_delay -clock clk  0  [get_ports {kernel[49]}]
set_input_delay -clock clk  0  [get_ports {kernel[48]}]
set_input_delay -clock clk  0  [get_ports {kernel[47]}]
set_input_delay -clock clk  0  [get_ports {kernel[46]}]
set_input_delay -clock clk  0  [get_ports {kernel[45]}]
set_input_delay -clock clk  0  [get_ports {kernel[44]}]
set_input_delay -clock clk  0  [get_ports {kernel[43]}]
set_input_delay -clock clk  0  [get_ports {kernel[42]}]
set_input_delay -clock clk  0  [get_ports {kernel[41]}]
set_input_delay -clock clk  0  [get_ports {kernel[40]}]
set_input_delay -clock clk  0  [get_ports {kernel[39]}]
set_input_delay -clock clk  0  [get_ports {kernel[38]}]
set_input_delay -clock clk  0  [get_ports {kernel[37]}]
set_input_delay -clock clk  0  [get_ports {kernel[36]}]
set_input_delay -clock clk  0  [get_ports {kernel[35]}]
set_input_delay -clock clk  0  [get_ports {kernel[34]}]
set_input_delay -clock clk  0  [get_ports {kernel[33]}]
set_input_delay -clock clk  0  [get_ports {kernel[32]}]
set_input_delay -clock clk  0  [get_ports {kernel[31]}]
set_input_delay -clock clk  0  [get_ports {kernel[30]}]
set_input_delay -clock clk  0  [get_ports {kernel[29]}]
set_input_delay -clock clk  0  [get_ports {kernel[28]}]
set_input_delay -clock clk  0  [get_ports {kernel[27]}]
set_input_delay -clock clk  0  [get_ports {kernel[26]}]
set_input_delay -clock clk  0  [get_ports {kernel[25]}]
set_input_delay -clock clk  0  [get_ports {kernel[24]}]
set_input_delay -clock clk  0  [get_ports {kernel[23]}]
set_input_delay -clock clk  0  [get_ports {kernel[22]}]
set_input_delay -clock clk  0  [get_ports {kernel[21]}]
set_input_delay -clock clk  0  [get_ports {kernel[20]}]
set_input_delay -clock clk  0  [get_ports {kernel[19]}]
set_input_delay -clock clk  0  [get_ports {kernel[18]}]
set_input_delay -clock clk  0  [get_ports {kernel[17]}]
set_input_delay -clock clk  0  [get_ports {kernel[16]}]
set_input_delay -clock clk  0  [get_ports {kernel[15]}]
set_input_delay -clock clk  0  [get_ports {kernel[14]}]
set_input_delay -clock clk  0  [get_ports {kernel[13]}]
set_input_delay -clock clk  0  [get_ports {kernel[12]}]
set_input_delay -clock clk  0  [get_ports {kernel[11]}]
set_input_delay -clock clk  0  [get_ports {kernel[10]}]
set_input_delay -clock clk  0  [get_ports {kernel[9]}]
set_input_delay -clock clk  0  [get_ports {kernel[8]}]
set_input_delay -clock clk  0  [get_ports {kernel[7]}]
set_input_delay -clock clk  0  [get_ports {kernel[6]}]
set_input_delay -clock clk  0  [get_ports {kernel[5]}]
set_input_delay -clock clk  0  [get_ports {kernel[4]}]
set_input_delay -clock clk  0  [get_ports {kernel[3]}]
set_input_delay -clock clk  0  [get_ports {kernel[2]}]
set_input_delay -clock clk  0  [get_ports {kernel[1]}]
set_input_delay -clock clk  0  [get_ports {kernel[0]}]
set_input_delay -clock clk  0  [get_ports {bias[127]}]
set_input_delay -clock clk  0  [get_ports {bias[126]}]
set_input_delay -clock clk  0  [get_ports {bias[125]}]
set_input_delay -clock clk  0  [get_ports {bias[124]}]
set_input_delay -clock clk  0  [get_ports {bias[123]}]
set_input_delay -clock clk  0  [get_ports {bias[122]}]
set_input_delay -clock clk  0  [get_ports {bias[121]}]
set_input_delay -clock clk  0  [get_ports {bias[120]}]
set_input_delay -clock clk  0  [get_ports {bias[119]}]
set_input_delay -clock clk  0  [get_ports {bias[118]}]
set_input_delay -clock clk  0  [get_ports {bias[117]}]
set_input_delay -clock clk  0  [get_ports {bias[116]}]
set_input_delay -clock clk  0  [get_ports {bias[115]}]
set_input_delay -clock clk  0  [get_ports {bias[114]}]
set_input_delay -clock clk  0  [get_ports {bias[113]}]
set_input_delay -clock clk  0  [get_ports {bias[112]}]
set_input_delay -clock clk  0  [get_ports {bias[111]}]
set_input_delay -clock clk  0  [get_ports {bias[110]}]
set_input_delay -clock clk  0  [get_ports {bias[109]}]
set_input_delay -clock clk  0  [get_ports {bias[108]}]
set_input_delay -clock clk  0  [get_ports {bias[107]}]
set_input_delay -clock clk  0  [get_ports {bias[106]}]
set_input_delay -clock clk  0  [get_ports {bias[105]}]
set_input_delay -clock clk  0  [get_ports {bias[104]}]
set_input_delay -clock clk  0  [get_ports {bias[103]}]
set_input_delay -clock clk  0  [get_ports {bias[102]}]
set_input_delay -clock clk  0  [get_ports {bias[101]}]
set_input_delay -clock clk  0  [get_ports {bias[100]}]
set_input_delay -clock clk  0  [get_ports {bias[99]}]
set_input_delay -clock clk  0  [get_ports {bias[98]}]
set_input_delay -clock clk  0  [get_ports {bias[97]}]
set_input_delay -clock clk  0  [get_ports {bias[96]}]
set_input_delay -clock clk  0  [get_ports {bias[95]}]
set_input_delay -clock clk  0  [get_ports {bias[94]}]
set_input_delay -clock clk  0  [get_ports {bias[93]}]
set_input_delay -clock clk  0  [get_ports {bias[92]}]
set_input_delay -clock clk  0  [get_ports {bias[91]}]
set_input_delay -clock clk  0  [get_ports {bias[90]}]
set_input_delay -clock clk  0  [get_ports {bias[89]}]
set_input_delay -clock clk  0  [get_ports {bias[88]}]
set_input_delay -clock clk  0  [get_ports {bias[87]}]
set_input_delay -clock clk  0  [get_ports {bias[86]}]
set_input_delay -clock clk  0  [get_ports {bias[85]}]
set_input_delay -clock clk  0  [get_ports {bias[84]}]
set_input_delay -clock clk  0  [get_ports {bias[83]}]
set_input_delay -clock clk  0  [get_ports {bias[82]}]
set_input_delay -clock clk  0  [get_ports {bias[81]}]
set_input_delay -clock clk  0  [get_ports {bias[80]}]
set_input_delay -clock clk  0  [get_ports {bias[79]}]
set_input_delay -clock clk  0  [get_ports {bias[78]}]
set_input_delay -clock clk  0  [get_ports {bias[77]}]
set_input_delay -clock clk  0  [get_ports {bias[76]}]
set_input_delay -clock clk  0  [get_ports {bias[75]}]
set_input_delay -clock clk  0  [get_ports {bias[74]}]
set_input_delay -clock clk  0  [get_ports {bias[73]}]
set_input_delay -clock clk  0  [get_ports {bias[72]}]
set_input_delay -clock clk  0  [get_ports {bias[71]}]
set_input_delay -clock clk  0  [get_ports {bias[70]}]
set_input_delay -clock clk  0  [get_ports {bias[69]}]
set_input_delay -clock clk  0  [get_ports {bias[68]}]
set_input_delay -clock clk  0  [get_ports {bias[67]}]
set_input_delay -clock clk  0  [get_ports {bias[66]}]
set_input_delay -clock clk  0  [get_ports {bias[65]}]
set_input_delay -clock clk  0  [get_ports {bias[64]}]
set_input_delay -clock clk  0  [get_ports {bias[63]}]
set_input_delay -clock clk  0  [get_ports {bias[62]}]
set_input_delay -clock clk  0  [get_ports {bias[61]}]
set_input_delay -clock clk  0  [get_ports {bias[60]}]
set_input_delay -clock clk  0  [get_ports {bias[59]}]
set_input_delay -clock clk  0  [get_ports {bias[58]}]
set_input_delay -clock clk  0  [get_ports {bias[57]}]
set_input_delay -clock clk  0  [get_ports {bias[56]}]
set_input_delay -clock clk  0  [get_ports {bias[55]}]
set_input_delay -clock clk  0  [get_ports {bias[54]}]
set_input_delay -clock clk  0  [get_ports {bias[53]}]
set_input_delay -clock clk  0  [get_ports {bias[52]}]
set_input_delay -clock clk  0  [get_ports {bias[51]}]
set_input_delay -clock clk  0  [get_ports {bias[50]}]
set_input_delay -clock clk  0  [get_ports {bias[49]}]
set_input_delay -clock clk  0  [get_ports {bias[48]}]
set_input_delay -clock clk  0  [get_ports {bias[47]}]
set_input_delay -clock clk  0  [get_ports {bias[46]}]
set_input_delay -clock clk  0  [get_ports {bias[45]}]
set_input_delay -clock clk  0  [get_ports {bias[44]}]
set_input_delay -clock clk  0  [get_ports {bias[43]}]
set_input_delay -clock clk  0  [get_ports {bias[42]}]
set_input_delay -clock clk  0  [get_ports {bias[41]}]
set_input_delay -clock clk  0  [get_ports {bias[40]}]
set_input_delay -clock clk  0  [get_ports {bias[39]}]
set_input_delay -clock clk  0  [get_ports {bias[38]}]
set_input_delay -clock clk  0  [get_ports {bias[37]}]
set_input_delay -clock clk  0  [get_ports {bias[36]}]
set_input_delay -clock clk  0  [get_ports {bias[35]}]
set_input_delay -clock clk  0  [get_ports {bias[34]}]
set_input_delay -clock clk  0  [get_ports {bias[33]}]
set_input_delay -clock clk  0  [get_ports {bias[32]}]
set_input_delay -clock clk  0  [get_ports {bias[31]}]
set_input_delay -clock clk  0  [get_ports {bias[30]}]
set_input_delay -clock clk  0  [get_ports {bias[29]}]
set_input_delay -clock clk  0  [get_ports {bias[28]}]
set_input_delay -clock clk  0  [get_ports {bias[27]}]
set_input_delay -clock clk  0  [get_ports {bias[26]}]
set_input_delay -clock clk  0  [get_ports {bias[25]}]
set_input_delay -clock clk  0  [get_ports {bias[24]}]
set_input_delay -clock clk  0  [get_ports {bias[23]}]
set_input_delay -clock clk  0  [get_ports {bias[22]}]
set_input_delay -clock clk  0  [get_ports {bias[21]}]
set_input_delay -clock clk  0  [get_ports {bias[20]}]
set_input_delay -clock clk  0  [get_ports {bias[19]}]
set_input_delay -clock clk  0  [get_ports {bias[18]}]
set_input_delay -clock clk  0  [get_ports {bias[17]}]
set_input_delay -clock clk  0  [get_ports {bias[16]}]
set_input_delay -clock clk  0  [get_ports {bias[15]}]
set_input_delay -clock clk  0  [get_ports {bias[14]}]
set_input_delay -clock clk  0  [get_ports {bias[13]}]
set_input_delay -clock clk  0  [get_ports {bias[12]}]
set_input_delay -clock clk  0  [get_ports {bias[11]}]
set_input_delay -clock clk  0  [get_ports {bias[10]}]
set_input_delay -clock clk  0  [get_ports {bias[9]}]
set_input_delay -clock clk  0  [get_ports {bias[8]}]
set_input_delay -clock clk  0  [get_ports {bias[7]}]
set_input_delay -clock clk  0  [get_ports {bias[6]}]
set_input_delay -clock clk  0  [get_ports {bias[5]}]
set_input_delay -clock clk  0  [get_ports {bias[4]}]
set_input_delay -clock clk  0  [get_ports {bias[3]}]
set_input_delay -clock clk  0  [get_ports {bias[2]}]
set_input_delay -clock clk  0  [get_ports {bias[1]}]
set_input_delay -clock clk  0  [get_ports {bias[0]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[287]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[286]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[285]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[284]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[283]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[282]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[281]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[280]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[279]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[278]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[277]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[276]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[275]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[274]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[273]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[272]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[271]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[270]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[269]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[268]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[267]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[266]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[265]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[264]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[263]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[262]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[261]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[260]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[259]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[258]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[257]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[256]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[255]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[254]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[253]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[252]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[251]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[250]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[249]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[248]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[247]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[246]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[245]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[244]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[243]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[242]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[241]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[240]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[239]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[238]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[237]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[236]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[235]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[234]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[233]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[232]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[231]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[230]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[229]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[228]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[227]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[226]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[225]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[224]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[223]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[222]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[221]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[220]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[219]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[218]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[217]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[216]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[215]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[214]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[213]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[212]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[211]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[210]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[209]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[208]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[207]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[206]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[205]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[204]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[203]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[202]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[201]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[200]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[199]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[198]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[197]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[196]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[195]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[194]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[193]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[192]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[191]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[190]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[189]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[188]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[187]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[186]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[185]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[184]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[183]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[182]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[181]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[180]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[179]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[178]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[177]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[176]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[175]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[174]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[173]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[172]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[171]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[170]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[169]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[168]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[167]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[166]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[165]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[164]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[163]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[162]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[161]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[160]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[159]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[158]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[157]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[156]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[155]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[154]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[153]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[152]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[151]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[150]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[149]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[148]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[147]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[146]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[145]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[144]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[143]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[142]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[141]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[140]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[139]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[138]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[137]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[136]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[135]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[134]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[133]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[132]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[131]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[130]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[129]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[128]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[127]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[126]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[125]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[124]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[123]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[122]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[121]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[120]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[119]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[118]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[117]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[116]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[115]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[114]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[113]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[112]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[111]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[110]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[109]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[108]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[107]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[106]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[105]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[104]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[103]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[102]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[101]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[100]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[99]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[98]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[97]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[96]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[95]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[94]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[93]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[92]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[91]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[90]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[89]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[88]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[87]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[86]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[85]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[84]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[83]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[82]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[81]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[80]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[79]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[78]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[77]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[76]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[75]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[74]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[73]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[72]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[71]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[70]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[69]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[68]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[67]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[66]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[65]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[64]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[63]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[62]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[61]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[60]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[59]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[58]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[57]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[56]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[55]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[54]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[53]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[52]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[51]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[50]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[49]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[48]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[47]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[46]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[45]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[44]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[43]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[42]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[41]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[40]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[39]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[38]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[37]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[36]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[35]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[34]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[33]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[32]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[31]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[30]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[29]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[28]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[27]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[26]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[25]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[24]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[23]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[22]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[21]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[20]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[19]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[18]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[17]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[16]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[15]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[14]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[13]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[12]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[11]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[10]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[9]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[8]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[7]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[6]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[5]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[4]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[3]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[2]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[1]}]
set_input_delay -clock clk  0  [get_ports {pixel_read[0]}]
set_output_delay -clock clk  0  [get_ports {state[3]}]
set_output_delay -clock clk  0  [get_ports {state[2]}]
set_output_delay -clock clk  0  [get_ports {state[1]}]
set_output_delay -clock clk  0  [get_ports {state[0]}]
set_output_delay -clock clk  0  [get_ports {next_state[3]}]
set_output_delay -clock clk  0  [get_ports {next_state[2]}]
set_output_delay -clock clk  0  [get_ports {next_state[1]}]
set_output_delay -clock clk  0  [get_ports {next_state[0]}]
set_output_delay -clock clk  0  [get_ports mode]
set_output_delay -clock clk  0  [get_ports input_en]
set_output_delay -clock clk  0  [get_ports {input_addr[15]}]
set_output_delay -clock clk  0  [get_ports {input_addr[14]}]
set_output_delay -clock clk  0  [get_ports {input_addr[13]}]
set_output_delay -clock clk  0  [get_ports {input_addr[12]}]
set_output_delay -clock clk  0  [get_ports {input_addr[11]}]
set_output_delay -clock clk  0  [get_ports {input_addr[10]}]
set_output_delay -clock clk  0  [get_ports {input_addr[9]}]
set_output_delay -clock clk  0  [get_ports {input_addr[8]}]
set_output_delay -clock clk  0  [get_ports {input_addr[7]}]
set_output_delay -clock clk  0  [get_ports {input_addr[6]}]
set_output_delay -clock clk  0  [get_ports {input_addr[5]}]
set_output_delay -clock clk  0  [get_ports {input_addr[4]}]
set_output_delay -clock clk  0  [get_ports {input_addr[3]}]
set_output_delay -clock clk  0  [get_ports {input_addr[2]}]
set_output_delay -clock clk  0  [get_ports {input_addr[1]}]
set_output_delay -clock clk  0  [get_ports {input_addr[0]}]
set_output_delay -clock clk  0  [get_ports {input_offset[5]}]
set_output_delay -clock clk  0  [get_ports {input_offset[4]}]
set_output_delay -clock clk  0  [get_ports {input_offset[3]}]
set_output_delay -clock clk  0  [get_ports {input_offset[2]}]
set_output_delay -clock clk  0  [get_ports {input_offset[1]}]
set_output_delay -clock clk  0  [get_ports {input_offset[0]}]
set_output_delay -clock clk  0  [get_ports read_en]
set_output_delay -clock clk  0  [get_ports {read_addr[15]}]
set_output_delay -clock clk  0  [get_ports {read_addr[14]}]
set_output_delay -clock clk  0  [get_ports {read_addr[13]}]
set_output_delay -clock clk  0  [get_ports {read_addr[12]}]
set_output_delay -clock clk  0  [get_ports {read_addr[11]}]
set_output_delay -clock clk  0  [get_ports {read_addr[10]}]
set_output_delay -clock clk  0  [get_ports {read_addr[9]}]
set_output_delay -clock clk  0  [get_ports {read_addr[8]}]
set_output_delay -clock clk  0  [get_ports {read_addr[7]}]
set_output_delay -clock clk  0  [get_ports {read_addr[6]}]
set_output_delay -clock clk  0  [get_ports {read_addr[5]}]
set_output_delay -clock clk  0  [get_ports {read_addr[4]}]
set_output_delay -clock clk  0  [get_ports {read_addr[3]}]
set_output_delay -clock clk  0  [get_ports {read_addr[2]}]
set_output_delay -clock clk  0  [get_ports {read_addr[1]}]
set_output_delay -clock clk  0  [get_ports {read_addr[0]}]
set_output_delay -clock clk  0  [get_ports write_en]
set_output_delay -clock clk  0  [get_ports {write_addr[15]}]
set_output_delay -clock clk  0  [get_ports {write_addr[14]}]
set_output_delay -clock clk  0  [get_ports {write_addr[13]}]
set_output_delay -clock clk  0  [get_ports {write_addr[12]}]
set_output_delay -clock clk  0  [get_ports {write_addr[11]}]
set_output_delay -clock clk  0  [get_ports {write_addr[10]}]
set_output_delay -clock clk  0  [get_ports {write_addr[9]}]
set_output_delay -clock clk  0  [get_ports {write_addr[8]}]
set_output_delay -clock clk  0  [get_ports {write_addr[7]}]
set_output_delay -clock clk  0  [get_ports {write_addr[6]}]
set_output_delay -clock clk  0  [get_ports {write_addr[5]}]
set_output_delay -clock clk  0  [get_ports {write_addr[4]}]
set_output_delay -clock clk  0  [get_ports {write_addr[3]}]
set_output_delay -clock clk  0  [get_ports {write_addr[2]}]
set_output_delay -clock clk  0  [get_ports {write_addr[1]}]
set_output_delay -clock clk  0  [get_ports {write_addr[0]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[7]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[6]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[5]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[4]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[3]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[2]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[1]}]
set_output_delay -clock clk  0  [get_ports {kernel_addr[0]}]
set_output_delay -clock clk  0  [get_ports {bias_addr[5]}]
set_output_delay -clock clk  0  [get_ports {bias_addr[4]}]
set_output_delay -clock clk  0  [get_ports {bias_addr[3]}]
set_output_delay -clock clk  0  [get_ports {bias_addr[2]}]
set_output_delay -clock clk  0  [get_ports {bias_addr[1]}]
set_output_delay -clock clk  0  [get_ports {bias_addr[0]}]
set_output_delay -clock clk  0  [get_ports write_l1_picture_en]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[7]}]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[6]}]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[5]}]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[4]}]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[3]}]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[2]}]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[1]}]
set_output_delay -clock clk  0  [get_ports {write_picture_counter[0]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[15]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[14]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[13]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[12]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[11]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[10]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[9]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[8]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[7]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[6]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[5]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[4]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[3]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[2]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[1]}]
set_output_delay -clock clk  0  [get_ports {write_picture_total_counter[0]}]
set_output_delay -clock clk  0  [get_ports finish]
set_output_delay -clock clk  0  [get_ports {pixel_write[287]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[286]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[285]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[284]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[283]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[282]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[281]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[280]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[279]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[278]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[277]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[276]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[275]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[274]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[273]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[272]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[271]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[270]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[269]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[268]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[267]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[266]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[265]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[264]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[263]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[262]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[261]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[260]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[259]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[258]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[257]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[256]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[255]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[254]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[253]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[252]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[251]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[250]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[249]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[248]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[247]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[246]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[245]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[244]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[243]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[242]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[241]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[240]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[239]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[238]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[237]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[236]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[235]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[234]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[233]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[232]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[231]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[230]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[229]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[228]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[227]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[226]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[225]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[224]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[223]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[222]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[221]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[220]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[219]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[218]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[217]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[216]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[215]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[214]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[213]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[212]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[211]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[210]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[209]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[208]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[207]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[206]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[205]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[204]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[203]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[202]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[201]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[200]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[199]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[198]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[197]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[196]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[195]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[194]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[193]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[192]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[191]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[190]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[189]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[188]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[187]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[186]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[185]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[184]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[183]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[182]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[181]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[180]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[179]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[178]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[177]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[176]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[175]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[174]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[173]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[172]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[171]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[170]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[169]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[168]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[167]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[166]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[165]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[164]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[163]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[162]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[161]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[160]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[159]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[158]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[157]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[156]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[155]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[154]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[153]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[152]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[151]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[150]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[149]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[148]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[147]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[146]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[145]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[144]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[143]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[142]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[141]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[140]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[139]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[138]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[137]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[136]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[135]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[134]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[133]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[132]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[131]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[130]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[129]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[128]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[127]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[126]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[125]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[124]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[123]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[122]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[121]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[120]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[119]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[118]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[117]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[116]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[115]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[114]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[113]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[112]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[111]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[110]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[109]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[108]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[107]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[106]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[105]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[104]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[103]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[102]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[101]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[100]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[99]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[98]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[97]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[96]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[95]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[94]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[93]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[92]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[91]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[90]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[89]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[88]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[87]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[86]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[85]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[84]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[83]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[82]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[81]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[80]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[79]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[78]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[77]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[76]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[75]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[74]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[73]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[72]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[71]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[70]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[69]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[68]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[67]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[66]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[65]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[64]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[63]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[62]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[61]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[60]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[59]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[58]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[57]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[56]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[55]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[54]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[53]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[52]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[51]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[50]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[49]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[48]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[47]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[46]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[45]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[44]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[43]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[42]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[41]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[40]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[39]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[38]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[37]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[36]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[35]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[34]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[33]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[32]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[31]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[30]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[29]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[28]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[27]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[26]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[25]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[24]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[23]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[22]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[21]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[20]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[19]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[18]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[17]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[16]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[15]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[14]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[13]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[12]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[11]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[10]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[9]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[8]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[7]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[6]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[5]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[4]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[3]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[2]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[1]}]
set_output_delay -clock clk  0  [get_ports {pixel_write[0]}]
